[
    {
        "position": "Junior Accountant",
        "job_type": null,
        "company_name": "TMC Financing",
        "location": "Oakland, CA 94612",
        "company_rating": 5.0,
        "company_reviews": 2,
        "reviews_link": "https://www.indeed.com/cmp/Tmc-Financing/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lot95pibn803&fromjk=03471806201086ce&jt=Junior+Accountant",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "We are a small, dedicated group of people who work hard and are super friendly and fun. Our offices are in Uptown Oakland and people bring their dogs to work. The atmosphere is casual and comfortable. Senior leaders regularly seek input/feedback from staff, assign challenging work, and provide recognition for their accomplishments. Feedback is implemented to provide a fun work place that promotes employee interaction and idea sharing. TMC also encourages on-going training, and whenever possible, we promote from within the company.\n\nTMC offers flexible schedules, great benefits, and lots of perks, including catered lunches at least weekly, free snacks and sodas, gym reimbursement, company paid commuter checks, lots of celebratory parties, matching charity donation, paid maternity and parental leave, and a very generous vacation and holiday offering.\n\nIf are you interested in using your skills to help small businesses grow, please check out our two awesome opportunities and email your resume (in MS or PDF format) to jobs@tmcfinancing.com*protected email*!\n(Uptown Oakland)\n\nTMC Financing has an awesome opportunity for a Junior Accountant who wants to grow their career with a forward-thinking award-winning small business lender. The Junior Accountant is responsible for accounts payable and receivable, payroll, and banking. The Junior Accountant assists with general ledger duties and reporting as needed. Are you a talented data-driven and detailed oriented financial services professional? Do you go above and beyond in your obsession with detail? Most importantly, do you love being around talented people in a fast-paced, collaborative hybrid office environment? If you are open to working both in the office and work-from-home and the descriptions above sound like they fit your background and interest, this may be the opportunity for you.",
        "job_posted": "14 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=03471806201086ce&fccid=de115aaf8dbb353e&vjs=3",
        "page": 1
    },
    {
        "position": "Staff Accountant",
        "job_type": "Full-time",
        "company_name": "Williams Sonoma",
        "location": "San Francisco, CA",
        "company_rating": 3.5,
        "company_reviews": 2905,
        "reviews_link": "https://www.indeed.com/cmp/Williams--sonoma,-Inc./reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lp005308r000&fromjk=4326f83d2c66aefa&jt=Staff+Accountant",
        "salary_low": null,
        "salary_high": null,
        "experience": "1-3 years",
        "description": "We hope you're interested in building a home with us. Even if you don't feel that you meet every requirement listed in this job description, we still encourage you to apply.\nAbout the Accounting Team\nThe Property Accounting Department manages the Company’s leases and capital assets including land, buildings, furniture, equipment, software, and hardware. We perform accounting, provide guidance, and oversee the budget and forecast process for leases and capital expenditures.\nOverview of the Staff Accountant, Property Accounting role\nAs a staff accountant responsible for a mix of capital, lease, and marketing accounting, you will be in one of the rare accounting roles that work with many different groups within the company. You will be an organized and detailed team player with strong analytical and communication skills.\nResponsibilities\nResponsible for reporting and analysis of capital balances on a monthly/quarterly basis including account variance analysis\nPrepare necessary journal entries for capital activity and reconcile monthly sub-ledger to the general ledger\nProcess monthly fixed asset additions, retirements, and other adjustments\nCreate and monitor capital projects and provide monthly reconciliations on capital investments and associated depreciation\nProvide support for assigned business units including accounting issue resolution, asset maintenance, policy interpretation, and ad hoc projects\nAssist in the analysis of financial data; extract, assemble, interpret, and format data to facilitate economic or business decisions\nAssist department with annual and quarterly external audits and participate in the preparation of fixed asset schedules for SEC reporting\nProvide support for personal property tax filings to outside preparers\nPrepare journal entries and report for catalog marketing expense\nMaintain corporate and tax fixed asset books\nProvide support for lease accounting under ASC 842\nIdentify, test, and implement process improvements to gain efficiencies\nDevelop/update documentation and training materials for existing policies and procedures for all areas of responsibility\nOperate a computer and communicate via telephone\nTransport materials and equipment and lift, move and carry objects up to 50 pounds on a limited basis\nCriteria\nBachelor’s degree in Accounting or Finance\n1-3 years accounting/financial analysis experience\nStrong systems aptitude, experience in accounting systems (Oracle) a plus\nProficient in Microsoft Excel and Access\nAbility to communicate both verbally and through written mediums in a clear and concise manner\nSelf-starter, eager, problem solver, creative thinker, adaptable, strong analytical skills\nRequires a very organized and detailed oriented individual with ability to juggle multiple tasks\nExcellent customer service skills and willingness to partner with other team members\nThe retail industry experiences a plus\nAbility to perform work onsite in he San Francisco office pending state, local, and Company return to work guidance during and after the COVID-19 pandemic\nWe believe in People First\nWe firmly believe that working in a culture focused on diversity, equity, and inclusion spurs innovation, creates healthy and high-performing teams, and delivers superior customer experiences. Our DEI initiatives prompt associate participation and engagement, aligning with our core vision to reflect the communities where we do business and put people first.\nBenefits Just for You\nDepending on your position and your location, here are a few highlights of what you might be eligible for:\nA generous discount on all Williams-Sonoma, Inc. brands\nA 401(k) plan and other investment opportunities\nPaid vacations, holidays, and time off to volunteer\nHealth benefits, dental and vision insurance, including same-sex domestic partner benefits\nTax-free commuter benefits\nA wellness program that supports your physical, financial, and emotional health\nYour Journey in Continued Learning\nIn-person and online learning opportunities through WSI University\nCross-brand and cross-function career opportunities\nResources for self-development\nAdvisor (Mentor) program\nCareer development workshops and learning programs\nSpeaker series\nWSI will not now or in the future commence an immigration case or \"sponsor\" an individual for this position (for example, H-1B or other employment-based immigration\nThis role is not eligible for relocation assistance.\nWilliams-Sonoma, Inc. is an Equal Opportunity Employer. Williams-Sonoma, Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance, or other applicable state or local laws and ordinances.\nOur Company\n\n\nFounded in 1956, Williams-Sonoma, Inc. is the premier specialty retailer of high-quality products for the kitchen and home in the United States. Our family of brands are Williams Sonoma, Williams Sonoma Home, Pottery Barn, Pottery Barn teen, pottery barn kids, Rejuvenation, Mark & Graham, west elm, or Outward. These brands are among the best known and most respected in the industry. We offer beautifully-designed, stylish and functional products for every area of the home, including the kitchen, living room, bedroom, home office, closet, laundry room and even outdoor spaces. We've seen some big changes since our first brick-and-mortar store opened more than half of a century ago. What hasn't changed is our passion for high-quality products, functional design, outstanding customer service, and enhancing the lives of our customers and the communities where we operate. Today, we're a multi-brand, multi-channel, global enterprise supported by state-of-the-art technology and some of the most talented teams in retailing - and we're always looking for new energy and ideas.",
        "job_posted": "5 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=4326f83d2c66aefa&fccid=cdd85c4d445cce0f&vjs=3",
        "page": 1
    },
    {
        "position": "Private Equity Accounting Fund Accountant - San Francisco, CA",
        "job_type": "Full-time",
        "company_name": "Gen II Fund Services",
        "location": "San Francisco, CA",
        "company_rating": 4.0,
        "company_reviews": 7,
        "reviews_link": "https://www.indeed.com/cmp/Gen-II-Fund-Services/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lp1qc39qh000&fromjk=914a7844876fcea4&jt=Private+Equity+Accounting+Fund+Accountant+-+San+Francisco%2C+CA",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Fund Accountant will be responsible for providing accounting services including preparation and processing of transactions and financial statements with supporting schedules and work papers.Primary Responsibilities Will Include: Cash processing and bank reconciliationsRecord journal entriesMaintain general ledgerPrepare and set up workpapers and checklistsPrepare financial statements and footnotesPrepare partner capital account informationInvestor capital call/distribution processingLiaise with the client’s independent auditorsJob Requirements, Skills, Education, and Experience: Bachelor’s degree in Accounting requiredMinimum GPA of 3.3All applicants applying to Gen II Fund Services, LLC must be legally authorized to work in the United States.Job Type: Full-timeBenefits:401(k)Health insurancePaid time offSchedule:Monday to Friday",
        "job_posted": "10 days ago",
        "url": "https://www.indeed.com/company/Gen-II-Fund-Services/jobs/Private-Equity-Accounting-Fund-Accountant-914a7844876fcea4?fccid=1370bdc6fa269aae&vjs=3",
        "page": 1
    },
    {
        "position": "Principal Account Clerk - Office of the Controller (1634)",
        "job_type": "Full-time",
        "company_name": "City and County of San Francisco",
        "location": "San Francisco, CA 94102",
        "company_rating": 4.0,
        "company_reviews": 238,
        "reviews_link": "https://www.indeed.com/cmp/City-and-County-of-SAN-Francisco/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lp4q0qekp800&fromjk=107f02a7434a2957&jt=Principal+Account+Clerk+-+Office+of+the+Controller+%281634%29",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Company Description\nThis 1634 Principal Account Clerk works in the Controller’s Accounting Operations and Suppliers Division (AOSD), with significant assignments in Asset Management. The 1634 may also support Citywide accounting operations and financial analysis as part of the Controller’s Financial & Accounting Support Team (FAST).\nAOSD’s primary mission is to control the financial activities of the City. The division certifies contracts, pays vendors, approves personnel requisitions and reviews, monitors, controls, and projects departmental expenditures on a continuous basis to assess overall fiscal condition. The division assists departments to achieve fiscal compliance, accuracy, timeliness and meaningfulness for the resulting financial information. The division is also responsible for the producing the City's annual audited financial statements including the Comprehensive Annual Financial Report (CAFR), the Single Audit Report, and other reports required by federal, state, and local regulations, as well as the Countywide Cost Allocation Plan (COWCAP). Other functions include developing and maintaining citywide financial systems, system policies, procedures, training, security, and documentation.\nAOSD is responsible for monitoring, tracking, approving and establishing guidelines, policies and procedures for central accounting across all City departments, including all City funds and grants. The City’s online accounting system, PeopleSoft, is used extensively in this work. The City’s data warehouse and analytical tool, Oracle Business Intelligence (BI), and Excel are also heavily used. The Asset Management team of AOSD manages the City’s fixed assets recording and reporting.\n\nJob Description\nUnder general supervision, the 1634 performs difficult bookkeeping and financial record keeping operations within complex accounting systems and may direct the work of other clerical staff. The person selected for this position will be required to interpret, enforce and carry out existing policies and procedures relative to financial record keeping activities; make regular contacts with other departmental personnel and the general public in connection with bookkeeping and financial operations; prepare and maintain a variety of complex financial and bookkeeping records and reports; post, adjust, and balance entries to ledgers; verify the correctness of accounting documents; respond to inquiries and provide financial information; organize and file source documents; perform operations involving automated accounting systems and spreadsheet programs and perform related duties as required.\nEssential duties of the job include but are not limited to:\nProcess financial, accounting, budget, general ledger, payables, purchasing, encumbrance and other transactions using PeopleSoft\nEnsure accurate and timely recording of financial data in compliance with Controller’s policies and procedures\nPerform financial data cleanup\nGenerate reports and queries as needed to support tasks using Oracle Business Intelligence, PeopleSoft Query, and PeopleSoft nVision\nPrepare GASB 84 and 87 related spreadsheets and audit binders\nAssist in year-end closing\nAssist with preparation of reports and financial audits, preparation of the Comprehensive Annual Financial Report (CAFR), and reporting to other government agencies, as needed.\nProvide feedback and clerical support on Policies and Procedures in use or proposed by the Controller’s Office or other department\nAct as a liaison between City departments and AOSD\nReview and manage 10-Key to foot and cross foot financial statements\nCompile CAFR draft binder for the Controller, senior management, and external auditors\nResearch information in PeopleSoft and the City’s legacy financial system\nReconcile various accounting and financial reports between different sources and systems, including between the legacy accounting system and current PeopleSoft system\nRespond verbally and in writing to phone, email and in-person questions and requests for information from the public and staff from other departments\nSort and file various accounting, financial and system documents\nTrain Controller’s and departmental staff as assigned\nCreate reports and logs using Excel, Word, PowerPoint, or other software.\nDirect work of other clerical staff\nAssumes FAST assignments as needed\nOther duties as required\n\nQualifications\n1. Two (2) years (equivalent to 4,000 hours) of verifiable experience in a position supervising and directing accounting and/or financial transaction functions. OR\n\n2. Fours (4) years (equivalent to 8,000 hours) of verifiable experience processing financial and accounting matters (e.g., cost records, deposits, expenditures, allocations), bookkeeping, and/or financial record keeping. Such experience typically includes verifying correctness of financial documents, maintaining expenditure records and reconciling subsidiary accounts.\n\nSubstitution of Experience:\n\n30 semester units / 45 quarter units of coursework from an accredited college or university with a minimum of 12 semester units (or equivalent quarter units) in accounting may be substituted for up to one (1) year of the required experience as described in #1 or #2.\nApplicants must meet the minimum qualification requirement by the final filing date unless otherwise noted.\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines.\nCONDITION OF EMPLOYMENT: All City and County of San Francisco employees are required to be vaccinated against COVID-19 as a condition of employment. For details on how it is applicable to your employment, please click here.\nThe City and County of San Francisco encourages women, minorities and persons with disabilities to apply. Applicants will be considered regardless of their sex, race, age, religion, color, national origin, ancestry, physical disability, mental disability, medical condition (associated with cancer, a history of cancer, or genetic characteristics), HIV/AIDS status, genetic information, marital status, sexual orientation, gender, gender identity, gender expression, military and veteran status, or other protected category under the law.",
        "job_posted": "5 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=107f02a7434a2957&fccid=a411072d5a46f13f&vjs=3",
        "page": 1
    },
    {
        "position": "Lead Real Estate Accountant",
        "job_type": "Full-time",
        "company_name": "CBRE",
        "location": "San Francisco, CA 94105",
        "company_rating": 3.7,
        "company_reviews": 3685,
        "reviews_link": "https://www.indeed.com/cmp/Cbre/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lp7koo1eo800&fromjk=1a0e6357ec22849c&jt=Lead+Real+Estate+Accountant",
        "salary_low": null,
        "salary_high": null,
        "experience": "four years",
        "description": "Posted\n01-Nov-2021\nService line\nAdvisory Segment\nRole type\nFull-time\nAreas of Interest\nProperty Management\nLocation(s)\nSan Francisco - California - United States of America\nJOB SUMMARY\nReviews and/or creates real estate accounting transactions and the production of the various resulting financial reports and statements. Understands client requirements and ensures consistent, accurate and timely reporting.\nESSENTIAL DUTIES AND RESPONSIBILITIES\nReviews assigned work product, including financial packages, to ensure complete, accurate and timely delivery to internal and external customers.\nAdheres to Client Accounting Policies and Procedures (CAPP) to ensure internal and external reporting requirements are consistently met.\nReviews and creates complex property budgets and forecasting for assigned property portfolios. Participates in new property and client transitions, and client audit requests.\nCommunicates requests for additional services from clients and the field to senior management and understands the scope of accounting services for the properties in portfolio.\nMay prepare and oversee all aspects of advanced level financial statement packages, including creating and posting journal entries, ensuring cash receipts and expense payables are recorded for the period, preparing and submitting funding requests. preparing and submitting owner's distributions, and other transactions as applicable in order to ensure that all information delivered to the client is complete and encompasses all transactions for the applicable reporting period.\nMay oversee the completion of projects including independent preparation and review of CAM (Common Area Maintenance) reconciliations, purchase/sale prorations, lease abstract analysis, property software setups, opening/closing entry generations, and maintenance of Policy & Procedure manuals.\nResolves and responds to escalated issues and requests from Account Management Team, Real Estate Management Team, and Clients, including answering questions from other departments, locations and divisions regarding various accounting issues and reports, including profit and loss reports. Researches open accounting issues and recognizes potential issues and/or conflicts so corrective action can intercept and minimize issues.\nPartners with the field and Account Management teams to ensure requirements and terms of the client's Management Agreement are adhered to based upon working knowledge of these agreements.\nMentors and provides training and guidance to team members on financial reporting functions and duties.\nLeads by example and serves as a role model for team members.\nPerforms other duties as assigned.\nSUPERVISORY RESPONSIBILITIES\nNo formal supervisory responsibilities in this position. Provides informal assistance such as technical guidance, and/or training to coworkers. May coordinate and assign tasks to co-workers within a work unit and/or project.\nQUALIFICATIONS\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nEDUCATION and EXPERIENCE\nDegree from a four-year college or university program with an emphasis in accounting, finance or related field required. A minimum of four years prior accounting, finance or related experience required. Experience with real estate accounting software preferred.\nCERTIFICATES and/or LICENSES\nNone\nCOMMUNICATION SKILLS\nExcellent written and verbal communication skills. Strong organizational and analytical skills. Ability to provide efficient, timely, reliable and courteous service to customers. Ability to effectively present information.\nAbility to respond effectively to sensitive issues.\nFINANCIAL KNOWLEDGE\nRequires advanced knowledge of Generally Accepted Accounting Principles (GAAP) and Financial Accounting Standards Board (FASB) regulations including an advanced knowledge of financial terms and principles to include accounting methods (cash, accrual, and full GAAP). Ability to calculate intermediate figures such as percentages, discounts, and/or commissions. Conducts advanced financial analysis.\nREASONING ABILITY\nAbility to comprehend, analyze, and interpret complex documents. Ability to solve problems involving several options in situations. Requires advanced analytical and quantitative skills.\nOTHER SKILLS and/or ABILITIES\nAdvanced knowledge of computer software and hardware (i.e. Microsoft Office Suite Products). Ability to work in multiple accounting software applications.\nSCOPE OF RESPONSIBILITY\nDecisions made with thorough understanding of procedures, company policies, and business practices to achieve general results and deadlines. Responsible for setting work unit and/or project deadlines. Errors in judgment may cause short-term impact to department.\nSAFETY\nResponsible for personal safety and the safety of those who are affected by your work. This includes but is not limited to:\n1. Complete all required and assigned HSE training at a satisfactory level,\n2. Follow all activity policies and procedures, including all HSE-related requirements at all times,\n3. Participate in all HSE-related programs & activities as required, including incident investigations, interviews, auditing and assessment, etc.\n4. Report any conditions which you feel could result in an accident or injury and / or stop work if required.\nNOTE: An additional requirement for this role is the ability to comply with COVID-19 health and safety protocols, including COVID-19 vaccination proof and/or rigorous testing.",
        "job_posted": "6 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=1a0e6357ec22849c&fccid=c9b9e477b3c84b4d&vjs=3",
        "page": 1
    },
    {
        "position": "Junior Grants Accountant",
        "job_type": "Full-time",
        "company_name": "LifeLong Medical Care",
        "location": "Berkeley, CA 94710",
        "company_rating": 3.4,
        "company_reviews": 62,
        "reviews_link": "https://www.indeed.com/cmp/Lifelong-Medical-Care/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lp9qd39qh000&fromjk=5e26447fc79da8e6&jt=Junior+Grants+Accountant",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Overview:\n\nSupporting Community Healthcare is a rewarding role, come join a wonderful organization! LifeLong Medical Care is looking for a Grants Accountant to join our Finance department in West Berkeley. Under the general supervision of the Grants Manager the Junior Grants Accountant's primary responsibility or various accounting and administrative work, supporting the Administration, Budget & Accounting operations.\nThis is a full time, benefit eligible position.\nLifeLong Medical Care is a large, multi-site, Federally Qualified Health Center (FQHC) with a rich history of providing innovative healthcare and social services to a wonderfully diverse patient community. Our patient-centered health home is a dynamic place to work, practice, and grow. We have over 15 primary care health centers and deliver integrated services including psychosocial, referrals, chronic disease management, dental, health education, home visits, and much, much more. LifeLong Medical Care is an equal opportunity employer. We strongly encourage applications from women, people of color, and bilingual and bicultural individuals and members of the lesbian, gay, bisexual, and transgender communities. Applicants shall not be discriminated against because of race, religion, sex, national origin, ethnicity, age, disability, political affiliation, sexual orientation, gender identity, color, marital status, or medical condition.\nBenefits\nWe offer excellent benefits including: medical, dental, vision (including dependent and domestic partner coverage), generous leave benefits including nine paid holidays, Flexible Spending Accounts, 403(b) retirement savings plan.\nCOVID-19 Vaccine Policy\nIn accordance with LifeLong Medical Care's commitment to provide and maintain a workplace that is free of known hazards, we have adopted a Mandatory COVID-19 Vaccine Policy to safeguard the health of our employees and their families; our patients and visitors; and the community at large from infectious diseases, that vaccinations may reduce. This policy will comply with all applicable laws and is based on guidance from the Centers for Disease Control and Order of the California State Public Health Officer. Unless a reasonable medical or religious accommodation is approved, all employees must receive COVID-19 vaccinations.\nResponsibilities:\nPerform monthly and periodic invoicing of our County, City and other grants timely and accurately.\nWork closely with grant managers for budgeting and reporting purposes.\nPrepare monthly/quarterly/yearly reports invoices/ financial reports\nPerform month-end reconciliations.\nWork with payroll department on positions paid by grants or restricted funds.\nMonitor and manage cash flows and expenses.\nPosting and tracking of Grant payments, and follow-up on unpaid outstanding receivables\nCommunicating with project managers on the balance and status of funds monthly or quarterly depending on the need and grant requirement\nQualifications:\nKnowledge of preparing behavioral health grant cost reports\nExcellent organizational skills necessary for managing competing priorities and deadlines.\nAbility to analyze complex fiscal and administrative issues and apply the appropriate measures for resolution.\nFlexibility and positive attitude\nExcellent communication skills and the ability to work with multiple stakeholders.\nHigh proficiency in Microsoft Excel and Word programs\nNon-Profit experience highly desired\nEducation and Experience\nAssociate degree preferred but may substitute degree with relevant work experience.\nAt least one year of experience directly related to the duties and responsibilities specified preferred. Knowledge of accounting system Financial Edge is preferred but not required",
        "job_posted": "12 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=5e26447fc79da8e6&fccid=97464f5e81e0c14b&vjs=3",
        "page": 1
    },
    {
        "position": "Audit & Assurance Senior Assistant",
        "job_type": "Full-time",
        "company_name": "Deloitte",
        "location": "San Francisco, CA",
        "company_rating": 4.0,
        "company_reviews": 10287,
        "reviews_link": "https://www.indeed.com/cmp/Deloitte/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lpd0focji800&fromjk=41e3c49ca37ce36b&jt=Audit+%26+Assurance+Senior+Assistant",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Do you have the forward-looking view to match ours? We are investing heavily in new innovations in data analytics and artificial intelligence using cutting-edge applications to differentiate our approach to audit. We're regarded as leaders in Audit and our approach is designed to provide the flexibility to serve the unique circumstances and complexities of our clients. Join us as an Audit & Assurance Senior Assistant and you'll help us to strengthen our reputation for quality and innovation.\n\nWork you'll do\n\nAs an Audit & Assurance Senior Assistant, you will work closely with our clients to understand their business, the risks they face and their internal controls. You'll use our cutting-edge audit tools and technology. Other responsibilities will include:\nAudit areas of the client financial statements, including transactions and internal controls\nPerform analysis on client data and document testing procedures performed\nEffectively work in a virtual environment\n\nThe team\n\nOur team culture is collaborative and encourages team members to take initiative and seek on-the-job learning opportunities. Our audit professionals are committed to excellence and to enhancing the trust of the investing public and capital markets. Quality is our top priority, and by focusing on innovation, we continue to raise the bar on quality and deliver greater value to our clients. Learn more about Deloitte Audit.\n\n\nQualifications\n\nRequired\nAt least 1 year of experience in public accounting\nBachelor's degree in accounting or related field\nMust meet minimum requirements for CPA eligibility before beginning full-time employment\n\nPreferred\nAdvanced degree in accounting or related field preferred\nExperience with a regional or Big 4 accounting firm preferred\nUnderstanding of broad business & technical (GAAP) knowledge\nEffective interpersonal and communication skills\nPotential for extensive travel\nExperience working independently on multiple assignments or engagements, even in a virtual environment\n\nHow you'll grow\n\nAt Deloitte, we believe in professional development and helping our people grow. We offer learning opportunities to help you sharpen your skills in addition to hands-on experience in the global, fast-changing business world. We support the development of leadership and technical skills through leading-edge learning development solutions such as our Welcome to Deloitte on-boarding program, career milestone learning programs, and Audit technical training. Deloitte University, our 107-acre, $300M center, demonstrates our commitment to development by delivering an interactive, immersive learning environment that offers a physical campus in a virtual world. Welcoming more than 50,000 learners annually from 81 countries, we're considered one of the leading private companies for growing leadership skills. Explore Deloitte University, The Leadership Center.",
        "job_posted": "1 day ago",
        "url": "https://www.indeed.com/rc/clk?jk=41e3c49ca37ce36b&fccid=9e215d88a6b33622&vjs=3",
        "page": 1
    },
    {
        "position": "Analyst, Transfer Pricing",
        "job_type": "Full-time",
        "company_name": "Kroll",
        "location": "San Francisco, CA 94103",
        "company_rating": 3.5,
        "company_reviews": 175,
        "reviews_link": "https://www.indeed.com/cmp/Kroll-Inc./reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lpgcsqekp800&fromjk=11231b972d60756b&jt=Analyst%2C+Transfer+Pricing",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "To be considered for a position at Kroll, you must formally apply via careers.kroll.com\n\nIn a world of disruption and increasingly complex business challenges, our professionals bring truth into focus with the Kroll Lens. Our sharp analytical skills, paired with the latest technology, allow us to give our clients clarity—not just answers—in all areas of business. We embrace diverse backgrounds and global perspectives, and we cultivate diversity by respecting, including, and valuing one another. As part of One team, One Kroll, you’ll contribute to a supportive and collaborative work environment that empowers you to excel.\nKroll’s Transfer Pricing practice applies microeconomic, financial and quantitative analysis to help multinational companies’ price products, intangible property and financial instruments for tax purposes. Our transfer pricing practice provides consulting and expert advice to many of the world’s largest multinational companies. Our Analysts receive world-class training, outstanding benefits, strong career progression, competitive salaries and relocation assistance when applicable.\n\nAt Kroll, your work will help deliver clarity to our clients’ most complex governance, risk, and transparency challenges. Apply now to join One team, One Kroll.\n\nRESPONSIBILITIES:\nTransfer Pricing Analysts work on a variety of assignments, including performing financial analysis, industry analysis and microeconomic research to assist companies in pricing their intercompany transactions. Our analysts gain experience in many facets of global consulting, including:\nPerforming financial and statistical analyses for clients that include Fortune 500 companies, top ranked law firms, non-profits, and government organizations\nDesigning and applying complex financial models to analyze and price intercompany transactions for products, services, intellectual property, and financial instruments\nConducting interviews with our clients’ executive leadership teams to gather focused insight into their company’s global operations\nPresenting results to both internal and external audiences\nUndertaking in-depth company, industry, and market research\nWriting client reports and preparing industry articles\nREQUIREMENTS:\nCurrently pursuing a Bachelor’s or Master’s degree in Economics, Finance, Business Administration or Management (with a concentration in Economics or Finance) or other degree (with Junior and/or Senior level courses in Economics or Finance) from an accredited university or college\nMust be available to start between January 2022 and September 2022\nMajor GPA of 3.0\nStrong Microsoft Word and Excel skills\nStrong analytical, critical thinking and problem-solving skills, as well as strong verbal and written communication skills\nAttention to detail, ability to manage time and work flow & work on multiple assignments\nDemonstrated ability to focus on quality work\nApplicants must be currently authorized to work in the United States without the need for visa sponsorship now or in the future\nTo be considered for a position at Kroll, you must formally apply via www.kroll.com\nKroll is committed to creating an inclusive work environment. We are proud to be an equal opportunity employer and will consider all qualified applicants regardless of gender, gender identity, race, religion, color, nationality, ethnic origin, sexual orientation, marital status, veteran status, age or disability.",
        "job_posted": "11 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=11231b972d60756b&fccid=2991547aff717aed&vjs=3",
        "page": 1
    },
    {
        "position": "Transfer Pricing Tax Associate",
        "job_type": "Full-time",
        "company_name": "RSM US LLP",
        "location": "San Francisco, CA 94104",
        "company_rating": 3.6,
        "company_reviews": 642,
        "reviews_link": "https://www.indeed.com/cmp/Rsm-9/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lpifvochl800&fromjk=1135cf7338b20353&jt=Transfer+Pricing+Tax+Associate",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "At RSM, associates work with large and small companies in various industries. They develop strong working relationships with clients built on understanding their businesses and challenges. Associates work on multiple team engagements each year, including several pieces of any particular assignment - not just one part. Working in a mutually respectful team environment helps our associates perform at their best and integrate their career with their personal life.\n\nTransfer pricing focuses on how different entities in a multinational business interact to generate profits together. Transfer pricing analysts combine qualitative/verbal factual analysis with numeric/quantitative analysis to understand the market and internal forces that allow multinational businesses to create value, and how the profits from that value creation are spread across different tax jurisdictions. Transfer pricing requires curiosity about business, a focus on precision, but also a comfort with ambiguity and qualitative reasoning. An interest in international matters is an advantage.\nTransfer pricing analysis is an important input for assisting client’s with their taxes, and the transfer pricing team is a component of RSM’s international tax practice, however no tax or accounting skills are assumed.\nExamples of the candidate’s responsibilities include:\nWorking on client engagements from start to finish, which includes planning, executing, and completing transfer pricing projects\n\nWorking with other associates and managers on transfer pricing projects, conducting detailed economic, financial, and accounting analyses demonstrating an understanding of transfer pricing concepts and method application to cases\n\nEvaluating intercompany transfers of tangible goods, intangible property, services, and loans and conducting financial and economic analyses of multinational and domestic corporations, industry and market research, economic valuations, comparative financial benchmarking, and report documentation\n\nWriting detailed reports and memoranda outlining client facts and analyzing market and economic factors. Strong writing skills are a must.\n\nPreparing and analyzing financial and economic data for tax and regulatory compliance through the use of MS Word, Excel, and various statistical sampling packages\n\nReviewing and analyzing GAAP financial statements\n\nInteracting with client personnel to gather information\nBasic Qualifications:\nBachelor's degree in Economics, Business/Management, or Finance\n\nKnowledge in several of the following areas: financial statement analysis, valuations, quantitative analysis, industry analysis, and statistical sampling and econometrics\n\nStrong analytical skills\n\nStrong written and verbal communication skills, solid research and computer skills including proficiency in Microsoft Office Suite, specifically MS excel, and the ability to work will both autonomously and collaboratively\nPreferred Qualifications:\nStrong attention to detail\n\nForeign language skills a plus\n\nAbility to work additional hours as needed and travel to various client sites\n\nAbility to prioritize tasks and work on multiple assignments\nYou want your next step to be the right one. You've worked hard to get where you are today. And now you're ready to use your unique skills, talents and personality to achieve great things. RSM is a place where you are valued as an individual, mentored as a future leader, and recognized for your accomplishments and potential. Working directly with clients, key decision makers and business owners across various industries and geographies, you'll move quickly along the learning curve and our clients will benefit from your fresh perspective.\n\nExperience RSM US. Experience the power of being understood.\n\nRSM is an equal opportunity/affirmative action employer. Minorities/Females/Disabled/Veterans.",
        "job_posted": "9 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=1135cf7338b20353&fccid=198b7374e1f8a26f&vjs=3",
        "page": 1
    },
    {
        "position": "Audit Associate II",
        "job_type": "Full-time",
        "company_name": "Grant Thornton",
        "location": "San Francisco, CA 94111",
        "company_rating": 3.7,
        "company_reviews": 1462,
        "reviews_link": "https://www.indeed.com/cmp/Grant-Thornton/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lplj9qekp800&fromjk=4e34c784dac5c58f&jt=Audit+Associate+II",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "POSITION SUMMARY\nAudit Associate\nThe Audit Associate will apply your knowledge of GAAP to assist in all stages of an audit using our Grant Thorntion Audit technology to complete assigned tasks. You may train and supervise others at a lower level including review of their work.\nESSENTIAL DUTIES AND RESPONSIBILITIES\nAudit transaction cycles, including cash, purchasing, investments, capital expenditures, and other income and expenses.\nGain understanding of client operations, processes, and business objectives and utilize that knowledge on engagements\nResearch and analyze financial statements and audit and tax related issues utilizing electronic databases, and employ audit software to review and compile financial information to resolve client issues discovered during the audit.\nDevelop and maintain a good working relationship with clients to enhance customer satisfaction and work with client management and staff at all levels to perform audit services.\nParticipate in recruiting efforts as needed.\nAttend professional development and training sessions on a regular basis. - Ability to work additional hours as needed and travel to various client sites.\nOther duties as assigned.\nQUALIFICATIONS\nBachelor’s degree in accounting, economics, finance, mathematics, or related discipline.\nMinimum of 1 year of public accounting experience in a medium to large firm.\nExcellent analytical, technical, and auditing skills including proficiency in US GAAP, GAAS, and PCAOB rules and standards.\nExcellent verbal and written communication skills.\nAbility to manage multiple engagements and competing priorities in a rapidly growing, fast-paced, interactive, results-based team environment.\nAbility to work additional hours as needed.\nAbility to travel on short notice.",
        "job_posted": "9 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=4e34c784dac5c58f&fccid=7ac82fceed64aa81&vjs=3",
        "page": 1
    },
    {
        "position": "TurboTax Live - Work From Home Tax Associate",
        "job_type": null,
        "company_name": "Intuit",
        "location": "San Francisco, CA 94102",
        "company_rating": 4.2,
        "company_reviews": 1663,
        "reviews_link": "https://www.indeed.com/cmp/Intuit/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lpooio29k800&fromjk=5605f4084e76d09d&jt=TurboTax+Live+-+Work+From+Home+Tax+Associate",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Overview\nDo you have a minimum of 3 season of paid Tax Preparation experience, with a minimum of 30 tax returns per tax year? If you're a tax professional, we need you to help our customers complete their taxes using TurboTax. You’ll advance our goal of “Powering Prosperity Around the World” by providing expert guidance and explanations of tax and technical terms to our customers. You’ll also play an important role in our effort to enhance our brand by delighting our customers and empowering them to prepare their taxes.\nWhat you'll bring\nMinimum 3 season of paid Tax Preparation experience, with a minimum of 30 tax returns per tax year required.\nPrior tax preparation experience in a tax practice or retail setting required.\nCollege degree a plus. The ideal candidate will have a background in business, finance, accounting, or tax\nKnowledge of tax laws, tax concepts and familiarity with form 1040 and schedules\nPTIN required\nAbility/motivation to expand expertise and obtain a tax credential or certification - Intuit offers a program to obtain your EA\nStrong customer service skills with ability to empathize and instill confidence\nAbility to work within a team to assist in preparation of accurate tax returns in a timely manner\nStrong Research skills and the ability to quickly use online resources to find answers\nCritical thinking and problem solving\nPersistence and determination\nWillingness to utilize audio/visual tools to communicate with customers\nComfortable interacting with customers through video, in a professional way that represents the Intuit TurboTax brand well\nFriendly and reassuring on camera\nBilingual (English/Spanish) communication skills (written & spoken) a plus\nFor internal use: tst assoc\nHow you will lead\nThis is a seasonal position providing assistance to customers both assisting them in preparing their own returns and/or fully preparing customer tax returns\nCompiling/preparing tax returns for TurboTax Customers\nGathering/organizing and accurately entering customer data in the federal and state tax returns for review\nCommunicate directly with the customer as needed\nCoordinate customer meetings and follow-up\nCommunicate updates to credentialed tax experts on assigned customers\nWill help customers who are working on their tax return with both product/software inquiries, as well as with tax questions and calculations\nApply defined practices, procedures and company policies to troubleshoot and resolve product and tax support customer inquiries\nWill interact with customers utilizing strong written and verbal skills as well as deep customer empathy\nTypical Deliverables:\nAccurate and complete customer data entered in tax returns for credentialed tax expert review\nHigh quality customer interactions and experiences\nApplication of defined practices, procedures and company policies to troubleshoot, resolve issues and address routine Tax Support customer questions\nProficient with technology and solid knowledge of computer operations and software.\nUtilize and leverage government websites and toolkits to seek out and deliver the right answer to the customer\nDocument customer interactions\nRepresent the Intuit TurboTax brand and spirit by demonstrating empathy for the customer, empowering and partnering with the customer, personalizing the experience, and providing them the confidence that they can do their own taxes\nIf you are a Colorado resident, visit intuit.com/careers/colorado-job-postings-information/",
        "job_posted": "14 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=5605f4084e76d09d&fccid=9784ae78e9834539&vjs=3",
        "page": 1
    },
    {
        "position": "Remote Seasonal Associate, Tax Exempt Organizations (990)",
        "job_type": null,
        "company_name": "KPMG",
        "location": "Walnut Creek, CA 94596",
        "company_rating": 3.9,
        "company_reviews": 6985,
        "reviews_link": "https://www.indeed.com/cmp/Kpmg/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lps39pi9s800&fromjk=ab2b3c2bfbf2df7f&jt=Remote+Seasonal+Associate%2C+Tax+Exempt+Organizations+%28990%29",
        "salary_low": null,
        "salary_high": null,
        "experience": "plus years",
        "description": "At KPMG, you can become an integral part of a dynamic team at one of the world’s top tax firms. Enjoy a collaborative, future-forward culture that empowers your success. Work with KPMG’s extensive network of specialists & enjoy access to our Ignition Centers, where deep industry knowledge merges with cutting-edge technologies to create innovative tax solutions. Join a diverse team helping high-profile clients understand, analyze, and respond to complex business opportunities and challenges. Develop your career through a range of multifaceted engagements, formal training, and informal mentoring.\nAt KPMG, we believe nothing is more important than investing in our culture because it’s an investment in our people, our future, and what we stand for as a firm.\nKPMG is currently seeking a Seasonal Tax Associate or Senior Associate to join our Development & Exempt Organizations practice.\nResponsibilities:\nPerform tax-related tasks, including tax compliance to tax exempt organizations (990)\nConduct grant expenditure evaluations and financial analysis of ongoing domestic and international grants\nOrganize and assist with pre-grant evaluations and ongoing grant monitoring activities\nCoordinate and liaise with KPMG offices worldwide that support grant expenditure evaluations, pre-grant evaluations, and other financial aspects of grant-related activities\nStay current on latest industry and philanthropic issues as well as tax practices as they relate to our client base\nWork as part of a multi-disciplinary team to develop and sustain excellent client relationships\nAdditional Responsibilities for Senior Associate:\nParticipate in and contribute to market and business activities external to the firm\nLead teams of tax professionals and assistants working on client projects\nQualifications:\nA minimum of one year of tax and advisory experience with exempt organizations in an accounting, law, and/or other professional services firm with a focus on the provision of services to exempt organizations preferred\nBachelor's degree in Accounting, Finance, Economics, Public & International affairs, Public Administration; Master of Accountancy, Master of Taxation, JD degree with a Bachelor of Accountancy, and/or LLM degree with a concentration in tax from an accredited college/university\nStrong interest and experience in philanthropic activities, volunteerism, and non-profit organizations\nEffective communication and time management skills\nExcellent financial analysis skills\nAbility to work as a team and strive for personal effectiveness and professionalism to maintain excellent client service\nAdditional Qualifications for Senior Associate:\nA minimum of two plus years of tax and advisory experience with exempt organizations in an accounting, law, and/or other professional services firm with a focus on the provision of services to exempt organizations preferred\nExperience managing multiple client engagements and client service teams with verbal and written communications skills\nKPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an affirmative action-equal opportunity employer. KPMG complies with all applicable federal, state and local laws regarding recruitment and hiring. All qualified applicants are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other category protected by applicable federal, state or local laws. The attached link contains further information regarding the firm's compliance with federal, state and local recruitment and hiring laws. No phone calls or agencies please.",
        "job_posted": "5 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=ab2b3c2bfbf2df7f&fccid=2dd390c3a48a7ed0&vjs=3",
        "page": 1
    },
    {
        "position": "Tax Experienced Staff - Transaction Tax Advisory - ITTS - US West",
        "job_type": null,
        "company_name": "EY",
        "location": "San Francisco, CA 94105",
        "company_rating": 4.0,
        "company_reviews": 7978,
        "reviews_link": "https://www.indeed.com/cmp/Ey/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lpv0gocbj800&fromjk=4482ca3524d4adf4&jt=Tax+Experienced+Staff+-+Transaction+Tax+Advisory+-+ITTS+-+US+West",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.\nLocation: SAN FRANCISCO, SAN JOSE, LOS ANGELES, HOUSTON, DALLAS\nOur Transaction Tax Practice is comprised of a dedicated team focused on the tax aspects of corporate and private equity acquisitions, dispositions, dispositions, restructurings and capital market transactions. As a staff on the Transactions team, we'll look to you to apply your knowledge to a wide range of tax areas, devising strategic outcomes to very complex issues, including US domestic and cross-border tax strategies. In return, you can expect support from the most recognized and engaging tax minds in the profession, and tremendous opportunities to progress your career.\nAs a Transaction Tax Staff, you'll be right at the heart of the action. You'll work with many of the world's largest organizations, fastest-growing companies and private equity firms on some of the most complex deals. You'll be advising clients throughout the transaction lifecycle on key drivers to increase value and reduce the risks and uncertainty inherent in transactions.\nThe opportunity\nOur Transactions practice is constantly evolving, and it's here you'll find everything you need to grow as we do. It's all about taking on new skills and responsibilities as they arise, and making the most of our dedicated mentors and training programs. Our Transaction Tax practice helps our clients plan, execute and integrate their transaction strategies. Our services include deal structuring, due diligence, post-deal integration, internal restructuring, distressed debt and bankruptcy, tax attribute management and planning, and drafting opinions and IRS ruling requests.\nYour key responsibilities\nAs a Staff you will be a member of the team developing and implementing transactions. You'll spend your time on a diverse array of project and clients in a highly collaborative culture. We'll look to you to develop relationships with our clients and team effectively with internal resources.\nSkills and attributes for success\nServe as a member of multiple client engagement teams, participating in due diligence and structuring engagements related to transactions for private equity and strategic corporate clients\nPerform due diligence projects to provide a thorough review of tax returns, legal documents and financial statements needed to evaluate and calculate potential tax exposures\nReview, assess, and advise clients regarding tax computations reflected in their financial models; and assist clients in the quantitative and qualitative analysis of the tax data in their financial projections for the transaction\nTo qualify for the role you must have\nUS CPA or member of US State bar\nA bachelor's degree required\nMinimum of about 1 year of related tax experience\nTax compliance experience preparing or reviewing business tax returns experience preferred\nTax due diligence, deal structuring, and post-acquisition planning experience preferred\nIdeally, you'll also have\nStrong writing, research, analytical, communication and presentation skills\nAbility to work in fast paced professional services environment\nWillingness and ability to travel, when necessary\nWhat we look for\nWe're interested in experienced tax professionals with a collaborative, client-focused approach to work. You'll need strong communication skills, and the ability to effectively prioritize when working with multiple clients. If you're a naturally curious problem solver with confidence to get involved and support colleagues and clients across the business, this role is for you.\nWhat we offer\nWe offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.\nContinuous learning: You’ll develop the mindset and skills to navigate whatever comes next.Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.\nIf you can demonstrate that you meet the criteria above, please contact us as soon as possible.\nThe exceptional EY experience. It’s yours to build.\nEY | Building a better working world\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.\nEY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, in accordance with applicable law.",
        "job_posted": "6 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=4482ca3524d4adf4&fccid=1544766d4c2915b0&vjs=3",
        "page": 1
    },
    {
        "position": "Casual Accountant",
        "job_type": "Part-time",
        "company_name": "City of Redwood City",
        "location": "Redwood City, CA 94063",
        "company_rating": 4.1,
        "company_reviews": 17,
        "reviews_link": "https://www.indeed.com/cmp/City-of-Redwood-City/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lq26mocji800&fromjk=ab85db0c5b0e6e39&jt=Casual+Accountant",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "JOB\nThe City of Redwood City invites you to apply for the position of Casual Accountant.\n\nA complete application is required, including a written supplemental questionnaire.\nSubmit your application online via CalOpps by 11:59 pm on Sunday, November 28, 2021.\nApplications will be reviewed continuously as they are received.\nPlease click on the job announcement file to review the recruitment flyer here.",
        "job_posted": "3 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=ab85db0c5b0e6e39&fccid=f3427807a5254b72&vjs=3",
        "page": 1
    },
    {
        "position": "MTS Tax Data Technologist - Tax Consultant II",
        "job_type": "Full-time",
        "company_name": "Deloitte",
        "location": "Foster City, CA",
        "company_rating": 4.0,
        "company_reviews": 10287,
        "reviews_link": "https://www.indeed.com/cmp/Deloitte/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lq5gfo27a800&fromjk=b9931d89b8608946&jt=MTS+Tax+Data+Technologist+-+Tax+Consultant+II",
        "salary_low": null,
        "salary_high": null,
        "experience": "numerous years",
        "description": "MTS Tax Data Technologist - Tax Consultant II\n\nDescription\n\nAre you a strategic and creative Tax professional who likes solving complex state and local tax issues? Are you ready to make a greater impact on organizations by combining tax consulting solutions and innovative technology that align the tax function with business objectives? We are looking for a Tax Consultant II who can drive technology to solve challenges and join one of the largest multistate tax practices in the United States.\n\nWhat you'll do\n\nAs a Tax Consultant II within the Multistate Tax Services group, you will provide innovative technology solutions to complex state and local tax issues across a diverse client base. You will continue to grow your technical knowledge in state taxation and emerging technologies by working on large, complex tax projects. You will have access to exceptional resources. Responsibilities include:\n\nIdentifying opportunities to improve operational efficiencies and streamline work flows through application of emerging technologies and implementing those ideas.\nContributing to innovation efforts within Deloitte's multistate tax practice.\nSupporting development efforts for new state tax technology applications or offerings\nProviding support on client projects related to state tax technology offerings.\n\nThe Team\n\nDeloitte's Multistate Tax Services (MTS) group is the largest State and Local Tax (SALT) practice in the United States with more than 1,000 professionals nationwide. Our Multistate Tax professionals include former state tax auditors and administrators, industry personnel, tax practitioners, accounting specialists, and technology personnel with numerous years of multistate tax experience. Collectively, our team has significant experience with the requirements and nuances of jurisdictions in all 50 states. Our specific services include state income and franchise tax, indirect tax, business restructuring, credits and incentives, sales and use tax outsourcing, excise tax, property tax, state strategic tax review, and state tax controversy.\n\nQualifications\n\nRequired:\n\n1+ years of experience in Corporate tax compliance or other tax experience\nExperience with data extract/transform/load (ETL) tools (e.g. Alteryx, Informatica, PAXATA)\nBachelor's degree in finance, accounting or computer science relevant field\nTravel up to 50% (While 50% of travel is a requirement of the role, due to COVID-19, non-essential travel has been suspended until further notice.)\nCPA, Enrolled Agent, or other appropriate certification (either in process or able/willing to obtain)\nLimited sponsorship may be available\n\nPreferred:\n\nState taxation experience\nExperience with ONESOURCE compliance /provision software tools\nOrganizational skills with ability to multitask/manage multiple projects simultaneously\nCreative and problem-solving skills\nFamiliarity with data visualization and analytics tools (e.g. Power BI, Tableau, QlikView)\nAdvanced degree such as Masters of Tax or JD and/or LLM\nPrevious Big 4 or large CPA firm experience\n\nHow you'll grow\n\nAt Deloitte, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there's always room to learn. We offer opportunities to help sharpen skills in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs at Deloitte University, our professionals have a variety of opportunities to continue to grow throughout their career. Explore Deloitte University, The Leadership Center.\n\n\nBenefits\n\nAt Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.\n\n\nDeloitte's culture\n\nWe take pride in our culture and celebrate individuals by recognizing their uniqueness. As a commitment to our people, we offer well-being programs and provide our professionals opportunities for support and flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. This supportive culture helps enable our people to do their best work every day. Learn more about Life at Deloitte.\n\n\nCorporate citizenship\n\nDeloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte's impact on the world.\n\n\nRecruiter tips\n\nWe want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you're applying to. Check out recruiting tips from Deloitte professionals.",
        "job_posted": "8 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=b9931d89b8608946&fccid=9e215d88a6b33622&vjs=3",
        "page": 1
    },
    {
        "position": "Assurance Services Experienced Staff - Financial Services-Wealth and Asset Management-Multi-Locat",
        "job_type": null,
        "company_name": "EY",
        "location": "San Francisco, CA 94105",
        "company_rating": 4.0,
        "company_reviews": 7978,
        "reviews_link": "https://www.indeed.com/cmp/Ey/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lqbjpnpfj801&fromjk=4fd15ca5e709ef29&jt=Assurance+Services+Experienced+Staff+-+Financial+Services-Wealth+and+Asset+Management-Multi-Locat",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.\nOur Financial Services Organization is a unique, industry-focused practice, and the only one of its kind within a Big 4 firm — and the Wealth and Asset Management is a key sector within this area. With strong functional capabilities, industry-leading technology and a varied range of knowledge, our clients look to us for assurance services they can rely on every time. And as an Audit Experienced Associate, you’ll be at the heart of that goal, personally visiting high-profile clients on site to understand their unique needs and build your reputation as a trusted business advisor.\nThe opportunity\nThis is an area that has seen substantial investment, focused on technology, knowledge and development for assurance professionals. You’ll see that reflected in your career, with plenty of opportunities to take on new responsibilities. That could mean developing a deep professional knowledge base in one area, or diversifying to audit in other markets such as wealth and asset management, hedge fund, and private equity.\nYour key responsibilities\nYou’re likely to balance your time between engaging with a team of assurance professionals across a portfolio of projects, and personally engaging with our clients. It’s the perfect role if you’re looking to diversify your professional management skills and experiences, all while further developing your leadership skills.\nSkills and attributes for success\nPerforming complex and specific audit procedures, while developing effective, client-focused audit strategies\nProactively building relationships that support our ability to provide tailored services that meet a wide range of assurance needs and contribute to new business development\nIdentifying and reacting to potential risks and developing new ways to improve our products and processes that promote growth and increase revenue\nContinually updating your understanding of business trends and emerging technologies to maintain your reputation as a trusted business advisor\nTo qualify for the role you must have\nA bachelor’s degree in Accounting, Business or Finance, supported by approximately 1 year of work experience as an auditor in a public accounting firm.\nA record of excellence in serving clients across the WAM industry\nA CPA certification in the work state location\nEngagement management, execution and reporting skills, and the ability to build relationships with clients with a diverse range of backgrounds\nConfidence in your ability to prioritize when managing multiple project simultaneously\nIdeally you’ll also have\nA firm understanding of engagement economics\nA proven ability to build a network of contacts and mutual business relationships\nWhat we look for\nWe’re interested in leaders who are creative and agile thinkers, with a genuine interest in improving our audit capabilities. You’ll also need to be a capable communicator both in the boardroom and across your team. If you have the technical and personal skills to understand our clients and provide excellent services every time, this role is for you.\nWhat we offer\nWe offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.\nContinuous learning: You’ll develop the mindset and skills to navigate whatever comes next.Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.\nIf you can demonstrate that you meet the criteria above, please contact us as soon as possible.\nThe exceptional EY experience. It’s yours to build.\nEY | Building a better working world\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.\nEY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, in accordance with applicable law.",
        "job_posted": "6 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=4fd15ca5e709ef29&fccid=1544766d4c2915b0&vjs=3",
        "page": 2
    },
    {
        "position": "Staff Accountant",
        "job_type": "Full-time",
        "company_name": "SD Mayer and Associates",
        "location": "San Francisco, CA 94104",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": 60000,
        "salary_high": 75000,
        "experience": null,
        "description": "Join Our TeamSD Mayer & Associates LLP is one of the leading companies in our field in the area. We're proud of our 4.6 ratings on Glassdoor from our employees. We are hiring a talented full-time Staff Accountant professional to join our team. If you're excited to be part of a winning team, SD Mayer & Associates LLP. is a great place to grow your career. You'll be glad you applied.You will be working in our Outsource department, along with our excellent manager, senior, and staff professionals. This position will be responsible for:Providing excellent support to both for-profit and not-for-profit clients.Assisting with monthly closes and financial reportingEnsuring the accurate and timely completion of all assigned tasksProactively anticipating clients' needs and proposing solutions to their accounting challenges.Skills and QualificationsAbility and willingness to keep maintain confidentialityFamiliarity with accounting and corporate finance principles and proceduresAbility to multitask, prioritize, and organize efficientlyExcellent oral and written communication skills.Begin to understand client needs, identifies root causes of problems, and implements pragmatic solutions.Preferred QualificationsKnowledge of GAAP (generally accepted accounting principles in the U.S.) a plusDesire to continue to grow through continuing trainingQuickBooks OnlineBill.comInsurance, Health& WellnessHealth Insurance (90% covered by employer) Flexible Spending Account (FSA)Life Insurance Dental Insurance (Free)Vision Insurance (Free) Disability InsuranceBenefitsUnlimited PTO Paid HolidaySick Pay Bereavement LeaveRetirement Plan Awesome Company CulturePerks & DiscountsCompany Social Events Gym MembershipMonthly Lunch Catering Happy HourCheck us out: https://www.sdmayer.com/Firm ProfileSD Mayer &Associates is a fast-growing, full-service, community-minded accounting, advisory, and outsourced accounting firm. We can also help clients plan for their future through our retirement and wealth management services. We have the expertise to help clients in a variety of industries, including creative services, financial services, hospitality & leisure, professional services, manufacturing & distribution, nonprofits, real estate & construction, retail, technology, and public companies.SD Mayer &Associates is located in The Russ Building and is based in San Francisco, with offices in Menlo Park and Seattle, along with consultants located in key locations throughout the United States. We can also tap into our global resources through our membership with BDO Alliance, the fifth-largest association of accountants, consultants, and professional services firms. With more than 550 independent alliance firm locations, the Alliance represents nearly every state and includes a comprehensive range of services. Member firms are fully autonomous, united in mindset, the caliber of service, and spirit of collaboration, to the benefit of all involved – BDO and its clients, Alliance members, and their clients.We have been consistently named a \"Best Place to Work,\" are listed as a \"Fastest Growing Private Company\" and have been named one of the Top Accounting Firms in the San Francisco Bay Area, as well as the Best Accounting Firm by Best of Small Business Awards 2019.Our managing partner, Stephen D. Mayer, was a former CEO and co-founder of Burr Pilger Mayer (BPM), before founding SD Mayer & Associates in 2012. Steve brings his core values and over four decades of experience to his new firm: helping clients be successful in business and life, investing in and serving the community, and having fun.Job Type: Full-timeJob Type: Full-timePay: $60,000.00 - $75,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceDisability insuranceFlexible scheduleFlexible spending accountHealth insuranceLife insurancePaid time offVision insuranceWork from homeSchedule:Monday to FridaySupplemental Pay:Bonus payAbility to commute/relocate:San Francisco, CA 94104: Reliably commute or planning to relocate before starting work (Required)Education:Bachelor's (Preferred)Work Location: One location",
        "job_posted": "13 days ago",
        "url": "https://www.indeed.com/company/SD-Mayer-and-Associates/jobs/Staff-Accountant-03a1d9298dec59d3?fccid=077e6eb877b48fc1&vjs=3",
        "page": 2
    },
    {
        "position": "Accountant I",
        "job_type": "Full-time",
        "company_name": "San Francisco Federal Credit Union",
        "location": "San Francisco, CA 94118",
        "company_rating": 2.8,
        "company_reviews": 8,
        "reviews_link": "https://www.indeed.com/cmp/SAN-Francisco-Federal-Credit-Union/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lqfk2o1dq800&fromjk=467befa79df1d56b&jt=Accountant+I",
        "salary_low": null,
        "salary_high": null,
        "experience": "1-2 years",
        "description": "Who Are We?\nWith an A health rating and solid year over year growth, San Francisco Federal Credit Union’s (SFFedCU) membership is now over 43,000, with assets surpassing $1.3 billion and branches located in San Francisco and San Mateo County. Continuing along its highly successful growth trajectory, SFFedCU is seeking an Accountant I who is able to work on site at our San Francisco headquarters.\nThe Position\nThe position is for early birds who can start their shift at 7:30 am. They will be posting and reconciling to the general ledger, working on accounts payable, fixed assets, investments, loan participation settlements, reporting and doing research and resolving discrepancies. Previous payroll experience with ADP TotalSource/EZ Labor is a big plus.\nWho Are You?\nThe Accountant I applies their knowledge and degree in Accounting along with their minimum of 1-2 years of experience to work in a fast paced yet accurate environment.\nWhy Join Us?\nThe compensation package includes an excellent benefits program including health insurance plans with 100% paid premiums on some plans, generous PTO, 401K contributions, profit sharing, a competitive base, annual and bi-annual bonuses, as well as commuter subsidies and tuition reimbursement.\nSFFedCU is an Equal Employment Opportunity Employer. In accordance with federal and state laws, SFFedCU does not discriminate in employment because of race, color, religion, sex, national origin, age, physical and mental disability, marital status, pregnancy, childbirth, breastfeeding or related condition, ancestry, medical condition (associated with cancer, a history of cancer or genetic characteristics), veteran or military status, sexual orientation, gender, gender identity or gender expression, HIV/AIDS status, genetic information or any other characteristic protected by law.\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.",
        "job_posted": "13 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=467befa79df1d56b&fccid=632a679dc67ecd71&vjs=3",
        "page": 2
    },
    {
        "position": "Accountant",
        "job_type": "Full-time",
        "company_name": "Spott, Lucey and Wall, Inc. CPAs",
        "location": "San Francisco, CA 94111",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": 71000,
        "salary_high": 71000,
        "experience": "2 years",
        "description": "Job Title:  AccountantLocation:  San Francisco, CaliforniaSPOTT, LUCEY & WALL, INC. is a San Francisco based CPA firm that provides comprehensive professional taxation, audit, accounting, and management advisory services to domestic and foreign businesses. We emphasize personalized service to our clients.SPOTT, LUCEY & WALL, INC. works with many of our clients on international business and tax affairs. We handle matters for foreign corporations investing in or owning United States businesses, foreign citizens working in the United States, as well as U.S. citizens and residents working abroad.Our tax department services include all areas of taxation including local property, payroll, sales and use, gross receipts, and multi-state income.SPOTT, LUCEY & WALL, INC. provides personalized planning services. We assist clients in making financial and business decisions. We also represent our clients in disputes with tax authorities.Spott, Lucey & Wall, Inc. is seeking top level accounting graduates who are committed to a lifelong career in public accounting and who aspire to eventual ownership in our firm. Our firm offers a diversity of professional experiences that begins during the first month with on-the-job experience in all aspects of accounting. You will be working directly with clients as soon as possible and help them make important decisions in their business. In addition, new staff members actively participate in staff meetings and have a voice in making decisions affecting the firm. If this is the career you are looking for and San Francisco is where you want to work, please contact us.Responsibilities:Preparation of federal, state and local income tax returns for individuals, corporations, S corporations, LLCs and partnershipsProvide accounting advisory support to clients, including implementation assistance with new accounting standardsEffective work paper preparation in compliance with firm standards and proceduresWork as an effective team member to complete project components and assignment tasks within the deadlineAbility to synthesize data and convey information in a meaningful waySupports growth and business development by marketing and social eventsQualifications:Entry level and up to 2 years of accounting experience with a public accounting firmBachelor's degree in accounting from an accredited college/universityIntention to study for and pass CPA exam within one year of graduationStrong knowledge of the U.S. GAAP and IFRSWe are ideally seeking candidates who do not require sponsorship for employment, but are also very interested in candidates who are fluent in German, Japanese, Arabic, Vietnamese, Swedish and FrenchWe are actively recruiting recent graduates, candidates that will be graduating within the next 6 months to a year and candidates that have up to 2 years’ experience. Please send your resume and unofficial transcripts, along with a cover letter that tells us why you think you are a good candidate.Spott, Lucey and Wall, Inc. offers a comprehensive compensation and benefits package.Job Type: Full-timePay: From $71,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceDisability insuranceFlexible scheduleHealth insuranceLife insurancePaid time offParental leaveProfessional development assistanceTuition reimbursementVision insuranceSchedule:Monday to FridayEducation:Bachelor's (Preferred)Work Location:One locationWork Remotely:Temporarily due to COVID-19Work Location: One location",
        "job_posted": "7 days ago",
        "url": "https://www.indeed.com/company/Spott,-Lucey-and-Wall,-Inc.-CPAs/jobs/Accountant-6eadc5567ef8f31e?fccid=9b2efb6aeabbc7a8&vjs=3",
        "page": 2
    },
    {
        "position": "Part-Time Staff Accountant",
        "job_type": "Part-time",
        "company_name": "SillaJen Biotherapeutics Inc",
        "location": "San Francisco, CA 94111",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Job Purpose(s)Provide invaluable inputs; perform accounting tasks and responsibilities essential to the company’s overall operations. Can work a flexible schedule of 4 to 6 hours a day.*Essential Duties and *ResponsibilitiesMaintain best practices for Purchase Order processing system.Manage the full cycle of Accounts Payable and perform periodic reconciliation to ensure all vendor accounts are current.Research and respond to all vendor inquiry and coordinate with involved parties to revolve discrepancies or issues, if any.Keep vendor information organized and accurate, including W-9’s; prepare year-end 1099 and 1096 tax reporting.Compile all intercompany Cost Shared invoices/expenses, and prepare a periodic summary report.Process employees’ expense reimbursements, ensure expenses are in accordance with the company’s T&E policy.Assist in month-end closing by preparing invoice accrual entries, coordinate with department heads to get invoices on time &/or invoice estimates, if any.Assist in the preparation of company’s local, state, and federal regulations and compliance.Perform administrative duties such as filings, mailings, documentation retention, office supplies ordering, and all other administrative tasks.Education and ExperienceBachelor’s degree in Accounting (or related field) with at least 1 year of hands on Accounts Payable and general accounting experience.*Specialized Skills*Must possess basic mathematic skills; ability to analyze figures; knowledge of Generally Accepted Accounting Principles and International Financial Reporting Standards; and excellent verbal and written skills. The candidate must be able to multi-task, establish priorities to meet deadlines, and organize efficiently. Knowledge of Microsoft Word and Excel, and familiarity with accounting software. NetSuite experience preferred._SillaJen will consider for employment qualified applicants consistent with the requirements of the San Francisco Fair Chance Ordinance._Job Type: Part-timeWork Location: Multiple Locations",
        "job_posted": "12 days ago",
        "url": "https://www.indeed.com/company/SillaJen-Biotherapeutics-Inc/jobs/Part-Time-Staff-Accountant-4dc4914c891c66b5?fccid=d0b47f1ecef3e535&vjs=3",
        "page": 2
    },
    {
        "position": "Staff Accountant",
        "job_type": "Full-time",
        "company_name": "Consumer Packaged Goods",
        "location": "San Rafael, CA 94901",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": 50000,
        "salary_high": 70000,
        "experience": "1-2 years",
        "description": "We are a leading California cannabis brand seeking an extremely bright, ambitious Staff Accountant. This is a great opportunity to develop your skills with a very professional, experienced finance team in a new growth industry. We are based in the Bay Area and Mendocino County, working remotely.Ideally you have- BS Finance, Accounting, Business with high GPA- 1-2 years’ accounting experience- CPA firm experience a +- Local candidates onlyPlease send us a short note highlighting your strengths along with your resume.Job Type: Full-timePay: $50,000.00 - $70,000.00 per yearBenefits:401(k)Dental insuranceFlexible scheduleFlexible spending accountHealth insurancePaid time offVision insuranceSchedule:Monday to FridayWork Location:One locationWork Remotely:Temporarily due to COVID-19Work Location: One location",
        "job_posted": "5 days ago",
        "url": "https://www.indeed.com/company/Consumer-Packaged-Goods/jobs/Staff-Accountant-956ce54da40b3b28?fccid=6f971068b408243d&vjs=3",
        "page": 2
    },
    {
        "position": "Staff Accountant",
        "job_type": "Full-time",
        "company_name": "Genesis Facility Services",
        "location": "San Mateo, CA 94402",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": 75000,
        "salary_high": 95000,
        "experience": "4 years",
        "description": "Genesis Facility Services is looking for an Accountant to support all areas of accounting (A/P, A/R, G/L, JE, reconciliations, reports) in our San Mateo office.We are a 4th generation family-owned company established in 1927 with a reputation built on strong customer service and relations and treating out employees with that same respect. We are highly collaborative and value accountability, strong work ethics and a focus on process improvement.What you will be challenged with: Oversight of A/P, G/L and JEGeneral bookkeepingMonthly, quarterly and annual closing processesWork wit CFO on regular reporting requirementsAccount reconciliationProvide support to the CFOBack up for A/R and, possibly, payrollWhat you bring to the companyA “get stuff done” attitudeAn “I can prove I can do it” attitudeA passion for accounting – detail and accuracy are what drive youExceptional Excel and systems skills – you are intermediate to advanced and not afraid to try things outAdvanced Experience with Quickbooks EnterpriseAbility to work independently with little supervision and direction (because you get things doneBachelor's degree and at least 4 years of experience, or equivalent combination of work experienceSpanish fluency is a plusWhat the company can offer you: Career path for growthCompetitive salaryHealth benefits – medical, dental, visionPaid HolidaysPaid vacation and sick timeIf this sounds like you, apply for immediate consideration. They are eager to find the right candidate.Job Type: Full-timePay: $75,000.00 - $95,000.00 per yearBenefits:401(k)Dental insuranceFlexible scheduleHealth insurancePaid time offVision insurancePhysical Setting:OfficeSchedule:8 hour shiftMonday to FridayWork Location:One locationWork Remotely:NoWork Location: One location",
        "job_posted": "7 days ago",
        "url": "https://www.indeed.com/company/Genesis-Facility-Services/jobs/Staff-Accountant-f9ad37ada8ded288?fccid=dc6f91531b5b25ee&vjs=3",
        "page": 2
    },
    {
        "position": "Junior Accountant and Procurement Specialist",
        "job_type": "Full-time",
        "company_name": "Thomas Edison Charter Academy",
        "location": "San Francisco, CA 94114",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Junior Accountant and Procurement SpecialistPosition ObjectiveUnder the direction of the Superintendent/Executive Director and Director of Finance, provide leadership and assistance with school and district projects to meet all compliance requirements and local, state and federal reporting needs.Duties and Responsibilities: Finance and Accounting Department Support: Print and process invoicesAssist with district level attendance and after school attendance oversight, verifying, and reportingUse the student system to monitor and verify school and afterschool attendance.Assist with accounts payable, including supporting the weekly check runAssist in the development of quarterly and annual financial reportingAssist with audit compliance and requestsAssist in updating Finance/Accounting reportsAssist with 1099 Form ProcessingAssist with Document FilingJournal and Adjusting Entries for AccountingData Entry for Accounting and FinanceReconciliation of Accounts and PaymentsAssist with data and document collection. (Jr.)Spreadsheet tracking for restricted funding.Procurement and Fiscal AccountabilityOrder supplies, materials and equipment for the school and district from approved vendors using the online system.Obtains price quotes from suppliers based on the approved purchase requests.Review prices and product specifications from various suppliers to determine which would provide the best deal.Track deliveries and make sure TECA receives exactly what was orderedDevelop procurement strategies for known needs, and develop streamlined systems for locating items, ordering items, documenting purchases, and financial coding.Monitor expenditures across all budgets, and provide updates for stakeholders, as needed.Fulfill all requests for event related food service needs, including overseeing set-up at events.Verify and process expense reimbursementsProcess purchase orders for the school and district.Other ResponsibilitiesMaintain administrative offices in professional working order (Jr.)Maintain professionalism and confidentiality required in work. (Jr.)Participate in business meetings (Jr.)Assist with other duties as assignedClerical support for employees on-boarding and benefitsFlexibility around weekly and daily duties to accommodate prioritizing the support to prepare Federal and State reporting deadlinesQualificationsBachelor's degree preferred, however Associates Degree and two-years of college acceptable with appropriate work experience in an accounting related fieldAble to effectively use Microsoft Office, Excel and Access and Google-related productsCommunicate effectively in both writing and speaking, and with children, adolescents and adults in EnglishTeam player with strong interpersonal skillsAbility to work in a fast-paced office, and maintain attention to detail and strong follow-throughThis is full-time, year-round position.Starting from $20.00-$24.00 per hour depending upon experience. November 2021Job Types: Full-time, ContractPay: $20.00 - $24.00 per hourBenefits:401(k)401(k) matchingDental insuranceDisability insuranceEmployee assistance programFlexible spending accountHealth insuranceLife insuranceParental leaveVision insurancePhysical Setting:OfficeSchedule:8 hour shiftMonday to FridayEducation:Bachelor's (Preferred)Experience:Financial accounting: 1 year (Required)License/Certification:CPA (Preferred)Work Location:One locationWork Remotely:NoWork Location: One location",
        "job_posted": "4 days ago",
        "url": "https://www.indeed.com/company/Thomas-Edison-Charter-Academy/jobs/Junior-Accountant-Procurement-Specialist-16c42a09c8d88d8c?fccid=592ff9b88d0510de&vjs=3",
        "page": 2
    },
    {
        "position": "Forensic Accountant",
        "job_type": "Full-time",
        "company_name": "Stegner McFarlin CPAs LLP",
        "location": "Walnut Creek, CA 94598",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": 55000,
        "salary_high": 70000,
        "experience": null,
        "description": "Looking for a public accounting role outside of audit or tax? Looking for a regional firm for more work/life integration? This staff forensic accountant position might be perfect for youOur firm is one of the premiere family law forensic accounting firms in the Bay Area. Additionally, we perform business valuations for hundreds of businesses across the country. Finally, we assist courts and attorneys in other forensic and fraud matters as expert witnesses.This entry-level position will get an opportunity to work in all of our service areas with plenty of on-the-job training. This position will assist with calculations related to family law forensic matters including tracings, income determinations, and stock analysis. Additionally, this position will learn how to determine the value of privately held businesses and draft reports to substantiate valuation conclusions. Additionally, this position will assist with other fraud and forensic matters to assist attorneys and the court.We are looking for a detailed oriented, bright accountant with interests outside of traditional public accounting looking to join a small but dynamic team. If interested, please submit a cover letter and resume.Job Type: Full-timePay: $55,000.00 - $70,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceHealth insuranceLife insurancePaid time offProfessional development assistanceVision insuranceWork from homePhysical Setting:OfficeSchedule:Monday to FridaySupplemental Pay:Bonus payCOVID-19 considerations:All customers are required to wear a mask. The entire firm is vaccinated and masks are required of all non-vaccinated employees and guests.Education:Bachelor's (Preferred)Experience:Public accounting: 1 year (Preferred)License/Certification:CPA (Preferred)Work Location: One location",
        "job_posted": "13 days ago",
        "url": "https://www.indeed.com/company/Stegner-McFarlin-CPAs-LLP/jobs/Forensic-Accountant-6cd97c252b74e0f1?fccid=7900d3a9f7c76cc6&vjs=3",
        "page": 2
    },
    {
        "position": "Accountant",
        "job_type": "Full-time",
        "company_name": "Elsener & Elsener, LLP",
        "location": "Sausalito, CA 94965",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Sausalito CPA firm is currently seeking tax associates at multiple levels.Positions available: Staff, Seniors and Managers.Challenging workload with strong opportunity for growth.Competitive salary, flexible hours, benefits and a friendly environment.Part-time or full-timeJob Type: Full-timeBenefits:401(k) matchingHealth insurancePaid time offProfessional development assistancePhysical Setting:OfficeSchedule:8 hour shiftMonday to FridayEducation:Bachelor's (Preferred)Work Location: One location",
        "job_posted": "12 days ago",
        "url": "https://www.indeed.com/company/Elsener-&-Elsener,-LLP/jobs/Accountant-99c26dbfd5c97cb8?fccid=0f9a5db64025d28a&vjs=3",
        "page": 2
    },
    {
        "position": "Staff Accountant",
        "job_type": "Full-time",
        "company_name": "WestCoast Children's Clinic",
        "location": "Oakland, CA 94601",
        "company_rating": 3.2,
        "company_reviews": 28,
        "reviews_link": "https://www.indeed.com/cmp/Westcoast-Children's-Clinic/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lr0q7o29k800&fromjk=dd2282cb9c943120&jt=Staff+Accountant",
        "salary_low": 60000,
        "salary_high": 60000,
        "experience": "1-2 years",
        "description": "Who are we?\n\nWestCoast Children's Clinic, located in Oakland, California, is a non-profit community psychology clinic that has provided mental health services to Bay Area children since 1979. Our mission is threefold: 1) to provide psychological services to vulnerable children, adolescents, and their families regardless of their ability to pay; 2) to train the next generation of mental health professionals; 3) to improve services to children and families by conducting research on the impact of clinical services and utilizing findings to advocate on behalf of the children we serve. Working at WestCoast Children's Clinic means being part of an organization that is client-centered, trauma-informed, collaborative, and committed to justice and equity.\nWho are we?\n\nWCC aims to improve the well-being of children and families who live at the intersection of racism, poverty, and systemic indifference. Working here means being part of an organization that is youth- & family-centered, trauma-informed, collaborative, and committed to justice and equity. We integrate direct service, training, policy, and research to root our work in the experiences of children, youth, and families and advocate for systemic changes that will improve the lives of young people. We have Staff Affinity Groups such as Staff of Color, LGBTQIA+, White Accountability, Equity and Inclusion, Health and Wellness, and more.\n\nAbout the Position:\n\nWestCoast Children's Clinic is seeking a Staff Accountant, who is responsible for processing a variety of accounting transactions in the Sage MIP accounting system. Responsibilities of this position will include preparing general ledger entries, supporting the monthly close, processing cash receipts, preparing balance sheet reconciliations and supporting the annual financial audit and tax preparation.\n\nKey Responsibilities:\n\nResponsible for maintaining accurate accounting records, reconciling all trial balance accounts, bank statements, credit card statements, and subsidiary ledgers.\nPrepare schedules for accruals, prepaids, and capital leases.\nPrepare, review and record revenue invoices.\nProcess Accounts Payable invoices (obtain authorization, record in general ledger, make payments)\nPrepare journal entries to record expenses from expense reimbursement system\nAllocates transactions to the appropriate program, departments and/or grants.\nSupport the annual audit and tax preparation by an external accounting firm.\nAdditional responsibilities as requested by the Senior Accountant.\n\nQualifications:\n\nBachelor's degree in Accounting or Finance with 1-2 years of experience in accounting, preferably in the non-profit sector.\nExperience with accounting software packages, preferably Sage MIP.\nProficient with Google Suite, Microsoft Word and Excel.\n\nCompetencies:\n\nSolid understanding of general ledger, accounts receivable, and fixed asset systems.\nThorough knowledge of all aspects of the accounting cycle and accounting rules (GAAP/FASB).\nStrong analytical and problem-solving skills\nAbility to prioritize and work accurately with close attention to detail; strong time management skills and an ability to work independently.\nExcellent written and oral communication skills.\n\nPosition Details and Compensation:\n\nThis is a full-time position. Starting salary is $60,000 per year and includes competitive benefits and compensation package, 403b and performance-based compensation plans.\n\n403b retirement contribution and performance-based compensation\n100% Employer paid medical, dental, vision, life insurance, and long-term disability coverage\nFlex-spending account options - Medical, Dependent Care and Commuter Plans\n20 days paid time off (PTO) per year for full time employees (pro-rated for less than full time), 14 Paid Holidays, Self-Care Leave, and additional PTO accrual with years of service.\n\nWorking here means making a difference for the Bay Area's most vulnerable kids and families, being part of a compassionate, driven team that is social justice-focused, and belonging to a growth-oriented learning community dedicated to providing the highest standard of care, and that offers extensive trainings led by field experts.\nJoin us and make a difference in the lives of vulnerable children and families in the Bay Area.\n\nWCC is passionate about leading and encouraging open conversations around race, gender, power, and privilege and how these impact community mental health. Our staff affinity groups include Staff of Color Council, LGBTQ Staff Group, White Accountability Group, and Equity and Inclusion Council.\n\nWe are an equal opportunity employer. We are committed to diminishing the influence of privilege and discrimination in our field and our workplace, whether due to differences concerning age, citizenship, color, disability, marital or parental status, race, religion, gender, or sexual orientation.",
        "job_posted": "5 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=dd2282cb9c943120&fccid=abbd33857d0ccc6e&vjs=3",
        "page": 2
    },
    {
        "position": "Staff Accountant",
        "job_type": "Full-time",
        "company_name": "SUPER LINK PLASTIC",
        "location": "Oakland, CA 94603",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "We are seeking a highly-skilled, experienced accountant to join our growing business. You will oversee the entire accounting function; delegating and ensuring the staff follows all accounting laws and company procedures. You must be able to take large amounts of accounting information, analyze results, and make changes where necessary to benefit the company.Report directly to the business ownerYou will be working with other accounting staff; creating accounting strategies to maximize profits; managing payroll and taxes; regularly examining financial statements to ensure accuracy and free from errors; organizing and updating financial records; monitoring all bookkeeping; analyzing accounts and suggesting improvements to reduce costs and increase profits; making sure all financial data adheres to current tax laws and regulations; keep company accounts information confidential; stay abreast of industry changes and current tax/accounting laws; prepare, manage, and present daily, weekly, and monthly reports; and act as a liaison to outside auditors.Job Type: Full-timePay: $25.00 - $35.00 per hourBenefits:Flexible schedulePaid time offPhysical Setting:OfficeSchedule:8 hour shiftMonday to FridaySupplemental Pay:Bonus payEducation:Bachelor's (Preferred)Work Location:One locationWork Remotely:NoWork Location: One location",
        "job_posted": "10 days ago",
        "url": "https://www.indeed.com/company/SUPER-LINK-PLASTIC/jobs/Staff-Accountant-4e07854edcfcde9f?fccid=2742442915309c43&vjs=3",
        "page": 2
    },
    {
        "position": "Staff Accountant",
        "job_type": "Full-time",
        "company_name": "CG Uhlenberg LLP",
        "location": "Belmont, CA 94002",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": 60000,
        "salary_high": 63000,
        "experience": "1+ years",
        "description": "Staff Accountant, CPA Local tax firm is seeking an associate or senior level accountant. This is a full-time salaried position to start in January 2022.Prepare individual, corporation, trust, and partnership income tax returnsPerform accounting services, such as preparation of financial statements in conformity with Generally Accepted Accounting PrinciplesPrepare other tax returns, such as gift, estate, payroll, sales, and property taxesPerform international tax compliance service, such as transfer pricing studies, and tax forms as required by Foreign Account Tax Compliance ActRequirement:1. Bachelor degree in accounting or equivalent2. Must be eligible for CPA exam or has already passed part or all CPA exam3. Excellent verbal and communication skill4. 1+ years of public accounting work experience, income tax preparation experience preferred but new graduate is welcome too.We follow all local and state COVID-19 mandates regarding working in office. We currently require all staff to be vaccinated or have an approved exemption. For training purpose, this position requires working in office at least during the first six months of employment. We will determine when and if the employee is ready to switch from in-office to hybrid. Currently, all staff are under hybrid workplace policy.We provide the following benefit:Health, dental, and vision insurance, long term disability insurance, 401K with matching, PTOFind out more about our firm at www.cgucpa.comJob Type: Full-timePay: $60,000.00 - $63,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceDisability insuranceFlexible scheduleHealth insurancePaid time offParental leaveVision insuranceWork from homePhysical Setting:OfficeSchedule:Monday to FridaySupplemental Pay:Bonus payApplication Question(s):Will you now, or in the future, require sponsorship for employment visa status (e.g. H-1B visa status)?Education:Bachelor's (Required)Experience:Accounting: 1 year (Preferred)Work Location:One locationWork Remotely:Temporarily due to COVID-19Work Location: One location",
        "job_posted": "4 days ago",
        "url": "https://www.indeed.com/company/CG-Uhlenberg-LLP/jobs/Staff-Accountant-11ece5885dda00f3?fccid=267aaeb99902696e&vjs=3",
        "page": 2
    },
    {
        "position": "Staff Accountant",
        "job_type": "Silverado Contractors",
        "company_name": "Silverado Contractors",
        "location": "Oakland, CA 94608",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": "2 years",
        "description": "Staff Accountant, Oakland CA Who we areWe are an industry-leading union contractor providing a full spectrum of demolition and excavation services to private developers, general contractors, industrial and public works clients throughout the west coast. Our scope of expertise includes every conceivable type of project including building demolition, selective demolition, industrial, marine, transportation, bridge removal, remediation, complete site decommissioning, plant closure, asset recovery and recycling, excavation, and site preparation. Notable past projects include the removal of the Bay Bridge, Candlestick Park, and the 6th Street Viaduct in Los Angeles. Please see our website at www.silveradocontractors.com.What we are looking forThe Staff Accountant assists with all aspects of the finance and accounting functions of the organization including AP/AR, job cost accounting, payroll, and cash flow management.Responsibilities Reporting to the Assistant Controller, the Staff Accountant will provide financial and payroll support services. The position works closely with other accounting personnel, internal departments, and external parties.Perform all duties in compliance with GAAP and applicable federal, state, and local regulatory laws and rules for financial and tax reporting.Assist processing A/P for the company’s sister companies.Assist with asset management process and reporting.Post journal entries and reconcile general ledger accounts as needed.Assist in processing monthly bank reconciliations.Assist with Union dues, Insurance, payroll tax reconciliation.Assist with month-end and year-end closing processes.Act as back-up to other accounting staff, payroll, and certified payroll.Additional duties as assigned.QualificationsMinimum Associates’ s degree (A.A.) in Accounting and 2 years professional work experience in accounting and I year experience in payroll or equivalent.Knowledge of generally accepted accounting principles.Proficiency in Microsoft Office (Word, Excel, and Outlook).Strong analytical problem-solving aptitude with creative solutions, ability to organize. work with large amounts of information efficiently.Manage multiple projects and deadlines simultaneously with strong attention to detail.Able to work as a team player.Open to development of skills and knowledge.Willingness to be flexible and adaptable to change.What's in it for you? Unmatched company culture.A company that invests in it 's employees' development.Competitive compensation - commensurate with experience and a rich benefits package including company-paid health, dental and vision plans, HSA, FSA, LifeInsurance and 401k plan with employer match and profit sharing.Local candidates encouraged to apply!Principals only. Recruiters, please do not contact.We are an equal opportunity employer and value diversity. All employment is decided on the basis of qualifications, merit, and business need.Job Type: Full-timePay: $24.00 - $33.00 per hourBenefits:401(k)401(k) matchingDental insuranceDisability insuranceEmployee assistance programFlexible spending accountHealth insuranceLife insurancePaid time offProfessional development assistanceTuition reimbursementVision insurancePhysical Setting:OfficeSchedule:8 hour shiftMonday to FridaySupplemental Pay:Bonus payCOVID-19 considerations:Our office is 100% vaccinated, we take all precautions, wearing masks in common areas, surfaces are sanitized regularly.Education:Associate (Preferred)Experience:GAAP: 1 year (Preferred)Work Location:One locationWork Remotely:NoWork Location: One location",
        "job_posted": "10 days ago",
        "url": "https://www.indeed.com/company/Silverado-Contractors/jobs/Staff-Accountant-d76cd706435186f1?fccid=0d6375bebbcfe728&vjs=3",
        "page": 2
    },
    {
        "position": "Accountant Assistant",
        "job_type": "Full-time, Part-time",
        "company_name": "Hycare, Inc.",
        "location": "San Leandro, CA 94577",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Hycare, a Premier health care provider has several skilled nursing facilities in the East Bay Areas. We are currently looking for an accountant Assistant full-time or part-time. Ideal candidate must have excellent computer skills: Excel, Word, etc. Preferred AA or BS degree in accounting. Experience preferred but willing to train the right candidate.We offer competitive monetary compensation with excellent benefits such as Medical, Dental, Vision, Paid sick leave, vacation, holiday and 401K. Interested candidates please send your resume to Hycare.Job Type: Full-timeJob Types: Full-time, Part-timeBenefits:401(k)Dental insuranceHealth insurancePaid time offVision insurancePhysical Setting:OfficeSchedule:8 hour shiftMonday to FridayEducation:Bachelor's (Preferred)Experience:GAAP: 1 year (Preferred)Work Location: One location",
        "job_posted": "11 days ago",
        "url": "https://www.indeed.com/company/Hycare,-Inc./jobs/Accountant-Assistant-100eceb81aca19a4?fccid=a658bd03a3e1792d&vjs=3",
        "page": 2
    },
    {
        "position": "Accountant Assistant",
        "job_type": "Full-time, Part-time",
        "company_name": "Hycare, Inc.",
        "location": "San Leandro, CA 94577",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Hycare, a Premier health care provider has several skilled nursing facilities in the East Bay Areas. We are currently looking for an accountant Assistant full-time or part-time. Ideal candidate must have excellent computer skills: Excel, Word, etc. Preferred AA or BS degree in accounting. Experience preferred but willing to train the right candidate.We offer competitive monetary compensation with excellent benefits such as Medical, Dental, Vision, Paid sick leave, vacation, holiday and 401K. Interested candidates please send your resume to Hycare.Job Type: Full-timeJob Types: Full-time, Part-timeBenefits:401(k)Dental insuranceHealth insurancePaid time offVision insurancePhysical Setting:OfficeSchedule:8 hour shiftMonday to FridayEducation:Bachelor's (Preferred)Experience:GAAP: 1 year (Preferred)Work Location: One location",
        "job_posted": "11 days ago",
        "url": "https://www.indeed.com/company/Hycare,-Inc./jobs/Accountant-Assistant-100eceb81aca19a4?fccid=a658bd03a3e1792d&vjs=3",
        "page": 3
    },
    {
        "position": "Accounting Manager",
        "job_type": "Full-time",
        "company_name": "Historic SF Collectibles",
        "location": "San Francisco, CA 94123",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": 70000,
        "salary_high": 90000,
        "experience": null,
        "description": "THE ROLEPrimary DutiesAll accounting functions – Accounts Payable, Accounts Receivable, Profit & Loss, Balance Sheets, Financial Statements, Payroll, bank reconciliations, cash and funding balances, reconciliation of accounts with inventory software, invoicing payables and receiving, managing sales tax accounts, and all other accounts that require attention. All accounting is done using GAAP standards.Creating reporting tools and presenting end of day reports at the end of each dayWorking with management to create achievable pro-formas.Consistently review all payables to find ways to save the company money.Secondary Duties(we are a small business, so all employees have secondary duties - they are about 20% of the job - we'll can talk about how they work)Basic HR Management – ensure all required paper work is obtained on employees, manage health insurance plan/vendor, track PTO, etc…(we have less than 10 employees, so this is not a time-consuming task)Office management – includes proper functioning of equipment, installation of software, and interfacing with vendors to ensure the proper functioning network.Marketing support – setup / maintain mailing list, manage advertising partners (newspaper, billboard, radio)THE SKILLSThorough knowledge of and experience with QuickBooks, Excel spreadsheets and Google DocsExperience in managing AP, AR, Payroll and all matters relating to same including payroll tax payments and quarterly reports, and all other items outlined aboveFully versed in modern office technology (basics of working in the cloud, understanding the essentials of an office network, printer troubleshooting, etc…)Detail and results orientedExcellent organizational skillsAble to take coaching and feedback constructivelyAbility to take initiative and solve problems independentlyIs great at organizing and are creating systemsComfortable being the “generalist” in an office of nerdy specialistsTHE STORYHistoric SF Collectibles is one of the nation’s most loved and recognized collectible companies in the county. Founded in 1960, it is still a family owned and operated business. In addition to the responsibilites listed below, it would be a bonus (but not a requirement) to find someone who had some curiosity and interest in our field of numismatics and collectibles. While interactions with inventory is not a part of your job, you will be steeped in an environment full of history, storytelling and technical expertise. Working here is more like working on the set of a Discovery Channel or PBS show (think Antiques Roadshow, Pawn Stars or American Restoration.) That said, this position involves the traditional skill set of an accountant. (It just might be even more enjoyable for someone who has an anecdotal interest in our quirky trade.)While no one can predict the future, we like the idea of hiring someone who can see themselves here for several years. Despite being a small business, we continue to grow and expand year over year and value our employees’ role in that. We are an office of less than 10 employees in an environment with lots of camaraderie and teamwork - so the ideal candidate will value this environment and thrive in it.Job Type: Full-timePay: $70,000.00 - $90,000.00 per yearBenefits:Dental insuranceHealth insurancePaid time offPhysical Setting:OfficeSchedule:Monday to FridaySupplemental Pay:Bonus payCOVID-19 considerations:All employees are required to be vaccinated for COVID-19.The safety of our employees and customers is of high importance to us.Education:Bachelor's (Preferred)Experience:GAAP: 1 year (Preferred)License/Certification:CPA (Preferred)Work Location: One location",
        "job_posted": "7 days ago",
        "url": "https://www.indeed.com/company/Historic-SF-Collectibles/jobs/Accounting-Manager-8a173919f67472c4?fccid=e94f28ad004c4906&vjs=3",
        "page": 3
    },
    {
        "position": "General Ledger Accountant",
        "job_type": "Full-time",
        "company_name": "Eden Enterprises Inc.",
        "location": "Oakland, CA 94612",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "About Eden Enterprises:\nEden Enterprises is a vertically integrated cannabis company with expanding interests in retail, cultivation, manufacturing, distribution, and intellectual property. Eden Enterprises hosts a number of operations comprising Garden of Eden (dispensary brand), Eden Infusions(distribution/manufacturing), Terpene Belt Farms (hemp cultivation) and Terpene Belt Processing (hemp processing). Our network of experience brought to the table by cannabis business veterans, both founding members and external partners, provides the basis for vertical integration across the entire cannabis and hemp supply chains.\nPrimary Responsibilities:\n\nAssist with month-end financial close process, including preparation of journal entries, reconciliations, Balance Sheet and P&L variance analysis\nAssist with quarterly reporting package standardize accounting processes\nDocument processes and policies while partnering with Internal Audit to identify risks and define mitigating procedures\nProvide support for external financial statement and regulatory compliance audits\nProcess accounts payable and accounts receivables.\nCompletes monthly financial statement close procedures to ensure timely reporting.\nAssists in the preparation of consolidated internal and external financial statements by gathering and analyzing information from the general ledger system and from departments.\nMaintains and balances an automated consolidation system by inputting data; scheduling required jobs; verifying data.\nPrepares payments by accruing expenses; assigning account numbers; requesting disbursements; reconciling accounts.\nAnswers accounting and financial questions by researching and interpreting data\nProtects organization's value by keeping information confidential\nPerforms other related duties as assigned or requested\n\nQualifications:\n\nFull-cycle accountant with experience in month end-close, journal entries, prepaids, fixed assets, straight line depreciation, AP and AR, reconciliations, accruals and revenue analysis\nCollaborated with internal stakeholders to support ad hoc projects as assigned\nSkilled in budgeting, annual tax filings, and quarterly financial reporting\nReconciled and analyzed accounts and resolved discrepancies with assigned general ledger accounts\nResponsible for management of fixed asset module, including reconciliation of model to the general ledger\nBS in Accounting preferred\n\nEden enterprises is an equal opportunity employer, and do not unlawfully discriminate against, make employment decisions, or permit harassment based on perceived or actual race, color, religion, sex, national origin, citizenship, immigration status, marital status, age sexual orientation, gender identity characteristics or expression, disability, medical condition, U.S Military or veteran status, salary history, or any other basis protected under federal, state, or local laws, regulations, or ordinances. Eden is committed to complying with all applicable laws providing equal employment opportunities, including by not limited to the Fair Pay Act, FEHA, and all applicable laws and ordinances regarding conviction and arrest history.",
        "job_posted": "10 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=19985108c43c66b8&fccid=f7fce6ca0ba87229&vjs=3",
        "page": 3
    },
    {
        "position": "Associate Revenue Accountant (Gross Accounting/Inventory Management)",
        "job_type": "Full-time",
        "company_name": "Wish",
        "location": "San Francisco, CA 94103",
        "company_rating": 3.6,
        "company_reviews": 10,
        "reviews_link": "https://www.indeed.com/cmp/Wish-2/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lrkhlo1n1800&fromjk=f8ecb932d9f31577&jt=Associate+Revenue+Accountant+%28Gross+Accounting%2FInventory+Management%29",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Company Description\nWish is a mobile e-commerce platform that flips traditional shopping on its head. We connect hundreds of millions of people with the widest selection of delightful, surprising, and—most importantly—affordable products delivered directly to their doors. Each day on Wish, millions of customers in more than 160 countries around the world discover new products. For our over 1 million merchant partners, anyone with a good idea and a mobile phone can instantly tap into a global market.\nWe're fueled by creating unique products and experiences that give people access to a new type of commerce, where all are welcome. If you’ve been searching for a supportive environment to chase your curiosity and use data to investigate the questions that matter most to you, this is the place.\n\nJob Description\nWish is looking for a full-time system savvy and detail-oriented Junior Inventory/Cost Accountant who will work closely with other accounting and finance team members. The accountant will play an integral role to manage all inventory aspects. This person is also a key player in assisting the Accounting team with month-end closing and account reconciliations, audit, and any ad hoc projects as needed. This is a great role for someone who is looking to continue their growth in an accounting career.\n\n**Strong preference for someone to be located within the PST time zone**\nWhat you'll be doing:\n Manage inventory quantities and costs and prepare month-end close journal entries, inventory valuation and inventory roll-forward\nReconcile inventory, receivables, revenue, deferred revenue and cost of sales accounts to the general ledger\nMonitor systems to assure timely inventory transaction costing in accordance with Company accounting policy\n Work closely and proactively with various groups domestically and internationally to ensure that inventory transactions flow smoothly and consistently with financial and management reporting requirements\nLiaise with the external auditors for the provision of audit related requests and resolution of any issues related to inventory\nAssist in ad-hoc projects as assigned\n#LI-KB1\n\nQualifications\n\nBA/BS in Finance, Accounting, Business Administration or related field\nProficient with Microsoft Office and other Web based Applications\nUnderstanding of US GAAP concepts relating to inventory, accounts receivable, revenue and cost of sales\nExperience with NetSuite, or other ERP system is preferred\nExcellent Microsoft Office skills, with emphasis on exceptional excel knowledge\nSelf-starter with ability to thrive in a fast paced and dynamic environment\nDemonstrates high degree of accuracy with detail-oriented work\n1-2 year minimum accounting experience\nAdditional Information\nWish values diversity and is committed to creating an inclusive work environment. We provide equal employment opportunity for all applicants and employees. We do not discriminate based on any legally-protected class or characteristic. Employment decisions are made based on qualifications, merit, and business needs. If you need assistance or accommodation due to a disability, please let your recruiter know. For job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records.\nIndividuals applying for positions at Wish, including California residents, can see our privacy policy here.",
        "job_posted": "6 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=f8ecb932d9f31577&fccid=63597530cb929df6&vjs=3",
        "page": 3
    },
    {
        "position": "Controller",
        "job_type": null,
        "company_name": "Stride Health",
        "location": "San Francisco, CA",
        "company_rating": 4.5,
        "company_reviews": 2,
        "reviews_link": "https://www.indeed.com/cmp/Stride-Health/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lrnoto2ar800&fromjk=321bcb833425229f&jt=Controller",
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Our mission at Stride is to build the world's first benefits platform designed for the independent workforce, and we're looking for amazing people (like you!) to help us do it. Today, 60 million Americans are working independently - in gig work or otherwise - and that trend is only accelerating. For many Americans, benefits are tightly coupled with their full-time, W2-based jobs where they receive group-based benefits. For the 60M Americans working independently and outside of that safety net, they need to find medical coverage on their own. That's where Stride comes in. We make it incredibly easy and intuitive to find the best and most affordable health care coverage for independent workers and their families, including dental, vision, life, accident, and disability coverage. All the same benefits you'd expect from a W2 employer, but built specifically for independent workers.\n\nStride partners with the world's leading platforms and employers of non-benefited workers including DoorDash, Uber, Postmates, MasterCard, Amazon, Aon, Keller Williams and others to help them provide their workers access to affordable health and wealth benefits and perks. The company is backed by Venrock, New Enterprise Associates, and F-Prime Capital Partners.\n\nAs our benefits enrollment platform gains more traction and continues to grow, so too does the complexity of our accounting operations, customer and vendor contracts, and financial instrumentation. For that reason, we're seeking a Controller to develop the team, implement and mature our accounting processes, and be a critical strategic thought partner to the business as we continue to scale. We are looking for a builder who can uplevel our accounting operations, systems, and tooling, and be a critical anchor in helping Stride grow our business.\n\nWe are a growing yet still small team (50+ employees) and believe in how small teams work - iterating and learning quickly. We believe you do your best work when you're working with a team you enjoy, leveraging your skills and experience to drive value, and focusing on new challenges that require new learning every day. Since we're small, we can guarantee you'll be doing a little bit of everything here. You love to bring creativity to your work to find top talent, love teaching others and helping your team succeed, and find satisfaction in building a company one quality hire at a time.\n\nWe're looking for somebody who is:\nPassionate about their craft - we value people who love what they do, and take pride in their work. We want to see that passion in you for understanding the financial mechanics of the business, and delivering value through sound accounting practices and decisions.\nAble to see the forest for the trees - You have an ability to understand downstream impacts of accounting decisions, how to leverage accounting to drive financial performance and KPIs, and a keen ability to go from the 2 to the 20,000 ft view.\nComfortable with ambiguity - You have a demonstrated ability to operate in a world of unknowns, where you are the expert and exercise appropriate executive judgement, make sound decisions exclusively, and advocate for those decisions effectively.\nA builder - comfortable hiring and scaling teams, implementing new systems and tools, instrumenting our financials to yield deeper insights, and partnering with our engineering and product teams to drive deeper integrations between our accounting and product infrastructure.\nFurther below is an example timeline of your first year at Stride.\n\n\nWithin 1 month you'll…\n\nMeet your new teammates, learn what they do and what makes Stride a special place to work\nLearn about our core values, mission, vision, and company goals\nMeet the executive team and leaders across the organization, and being building strong relationships with them\nDive into our financials, taking stock of current finance and accounting operations and practices\nMeet our bookkeeping firm, review current reconciliation schedules and other close artifacts, review and contribute to our existing close practices, and begin looking for optimizations\nHave a sound grasp of the accounting challenges facing the organization, and developed sense of solutions and paths forward\nDrive the development of Accounting's next set of leadership goals and objectives\n\nWithin 3 months you'll…\n\nOwn our financial close process from start to finish, driving consistently accurate closes and reporting on a timely and efficient basis\nDevelop, enhance and implement new accounting operations for key challenges facing the business\nPartner closely with FP&A and leadership to help drive our understanding of performance and fully leverage our financials to guide the business\nFacilitate and educate leadership on our financial performance, educating and preparing them for board and investor conversations\nEstablish KPIs that measure the success of accounting efforts and practices\n\nWithin 6-12 months you'll…\n\nComprehensively review all accounting practices, modify or implement new accounting practices, and iterate on them to become operationally efficient and effective\nTake a deep dive into our historic financials and implement changes based on your expertise\nImplement new accounting operations tool and processes to drive further efficiency and optimization, creating a word-class accounting function\nDevelop a forward looking vision for the team, including hiring additional support where needed, identifying the shape of team growth based on forecasted complexity, and key challenges to solve in the future\nHave contributed meaningfully towards getting the company ready for its next fundraise\nFeel excited to develop a growth plan for your next 6-12 months at Stride, and looking forward to growing your capabilities and furthering your career!\n\n\nWe're excited that you're looking to Stride for your next employment opportunity. We take that decision seriously and want to provide you with an opportunity where you can grow meaningfully in your career. We support a flexible work structure with headquarters in San Francisco, along with the option to establish your own fully remote office. We look forward to hearing from you!\nPerks & Benefits\nAt Stride we work hard, sweat the details, and enjoy life away from the computer, too. We are a diverse group that celebrates and supports our differences.\n\nCompetitive salary\nEquity packageHealth, dental, and vision plansFlexible work arrangement with the ability to work remotely and meet face to face with co-workers on a regular basis (as conditions permit)$100/month work from home stipend$75/month stipend for wellness programsCommuter benefits\nFlexible vacation time\nParental leave\nA culture of learning and development\nAnd more!\n\nCandidates must be legally eligible to work in the United States. Stride is an equal opportunity employer.",
        "job_posted": "11 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=321bcb833425229f&fccid=eb7ac56d332b93c0&vjs=3",
        "page": 3
    },
    {
        "position": "Controller, Accounting & Finance",
        "job_type": "Full-time",
        "company_name": "Kearns & West",
        "location": "San Francisco, CA 94104",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": "ten years",
        "description": "THE ORGANIZATIONKearns & West is a leader in the collaborative communications field, providing services in public involvement, stakeholder facilitation, community outreach, and mediation, primarily for government agencies. Founded in 1984, the small, woman-owned business has offices in San Diego, Los Angeles, Riverside, Costa Mesa, Sacramento, San Francisco, Portland, Denver and Washington, DC.Focusing on positive, mutually beneficial results has allowed Kearns & West to maintain long-term relationships with the people and organizations they assist. The firm’s high-stakes projects include work at local, state, and national levels and cover a variety of sectors including land use and community planning, transportation, energy, water, major public facilities and infrastructure, and natural resources. At the core of all our projects is finding solutions to advance essential policies and programs.Kearns & West is the ideal match for professionals seeking meaningful work, opportunities for growth, and colleagues that are smart, capable and supportive. Once on board, our employees stay for the long term. The entrepreneurial culture at Kearns & West values employee initiatives in practice innovation and business development – principal tracks are open to all team members. Compensation and benefits at Kearns & West are also highly competitive with firms in our field.THE POSITIONPosition Requirements:A successful candidate will have BA or BS in Business with an emphasis in accounting. A minimum of seven to ten years relevant and progressively challenging corporate accounting experience within the professional services industry is required.Experience working with federal, state and local government agencies preferred.The successful candidate must be PC proficient with Microsoft Office applications and able to thrive in a fast-paced setting with the ability to multi-task. The ability to communicate effectively at all levels of the organization, is essential as are strong people skills, a positive attitude, a customer service orientation and excellent communication skills. Strong organization and analytical skills coupled with the ability to handle multiple priorities and to set and meet deadlines is mandatory. A CPA certification is preferred but not required. Experience with the Deltek Suite of products preferred but not required.Position Responsibilities:Oversee the Accounting operations to promote a “customer service” oriented culture:Timesheet Management/ProcessEmployee Expense ReportsAccounts PayableVendor Management (new vendors/W9s)BillingGeneral LedgerResponsible for the month-end close that result in accurate financial statements:Monthly ReconciliationsPrepaid ExpensesDepreciation (Fixed Assets)Balance SheetReconciliation SupportVariance AnalysisReconcile Bank StatementsProvide guidance on cost proposal development and assistance with RFPs, bill rates, forms, etc.Cost Plus Rate DevelopmentTeam up with Finance and Project Teams to provide financial guidance on all projects.Cash Forecasting/Financial ForecastingFile Management of the accounting department and ContractsManage Year-End Close ProcessesGenerate Accurate Financial Reporting:Generate Monthly Financial StatementsBank ReportingLead FAR Compliance/ReportingLead with the CPA financial review and Tax preparationAccounting Team DevelopmentFinancial Systems Development/ManagementAssist the CFO in the following areas:Equipment Leases & FinancingBank RelationshipInsurance Policy RenewalsIncentive Compensation PlanTax ManagementBilling Rate Analysis and adjustmentsStaffing ProjectionsExpense Management/ControlDashboard reporting/analysisPerform other duties as directedCOMPENSATIONCompensation will depend on the qualifications and experience of the selected candidate.HOW TO APPLYPlease apply immediately by submitting cover letter and resume to personnel at kearnswest.com with the subject “44_Controller_SF”. We ask that you do not call or email staff directly. Resumes will be accepted until the position is filled.Job Type: Full-timePay: $25.00 - $57.00 per hourSchedule:Monday to FridayWork Location:One locationWork Remotely:Temporarily due to COVID-19Work Location: One location",
        "job_posted": "10 days ago",
        "url": "https://www.indeed.com/company/Kearns-&-West/jobs/Controller-b2a3cbb201095ae9?fccid=66c5989e2079b254&vjs=3",
        "page": 3
    },
    {
        "position": "Controller",
        "job_type": "Full-time",
        "company_name": "San Francisco Day School",
        "location": "San Francisco, CA 94118",
        "company_rating": 3.7,
        "company_reviews": 3,
        "reviews_link": "https://www.indeed.com/cmp/SAN-Francisco-Day-School/reviews?campaignid=mobvjcmp&cmpratingc=mobviewjob&from=mobviewjob&tk=1fk0lrt0bnq38800&fromjk=2edaf66efaad3fc4&jt=Controller",
        "salary_low": null,
        "salary_high": null,
        "experience": "more years",
        "description": "Position: Controller\n\nReports to: Chief Financial Officer\n\nSupervises: Two accounting FTEs\nPosition Status: 100% FTE Exempt\nABOUT SAN FRANCISCO DAY SCHOOL\nAt San Francisco Day School, we believe that when intellect and imagination are\n\nintertwined, students delight in the discovery of connection: in their academic and\n\ncreative pursuits, in their relationships, and in all that they experience here. Every day\n\nwe help our students emerge as flexible and resourceful learners. Because when we\n\ndo, our students light up with the call and capacity to take on the complexities of\n\ntheir day and of a diverse world.\nSF DAY FAST FACTS\n\nIndependent, co-educational school\nFounded in 1981\nServing 400 students\nLocated in the heart of SF\n\n\nThe SF Day Controller fosters the financial sustainability goals of the school through facilitating the management of the school’s financial resources.\nPRINCIPAL DUTIES\n\nOversee the day to day operations of the accounting team – AR, AP, payroll, cash receipts, etc.\nEnsure compliance with applicable laws, regulations, tax filings, professional standards and internal policies.\nManage customer requests, including employee and parent inquiries in a friendly, helpful and efficient manner.\nResponsible for the month-end close process to ensure timely financial statement reporting. This includes monthly and quarterly journal entries, bank reconciliations, investment reconciliation, and balance sheet account reconciliations (including advancement), etc\nProduce monthly financial statements including variance analysis of actual to budget.\nResponsible for the General Ledger, sub ledgers and all systems and processes that support it. Maintain general ledger in accordance with GAAP, donor restrictions and other regulatory requirements.\nCompile and issue monthly budget reports in a timely manner. Address budget manager questions.\nMonitor cash balances and initiate cash transfers to maintain appropriate balances.\nIdentify control weaknesses and propose changes.\nPrepare and update policies and procedures. Monitor and enforce compliance.\nOversee and manage external auditors in the completion of the annual financial statement audit. Prepare audit schedules, account analysis and address auditor questions.\nAdd and maintain new assets in the Fixed Asset module of Financial Edge, dispose of assets as directed, and generate depreciation as required. Prepare a year end roll forward workpaper that reconciles additions, disposals, depreciation expense, and gain and loss to the GL.\nResponsible for monitoring outstanding checks\nPlan and oversee the update and distribution of student enrollment package. Review contracts for completeness and update system.\nOversee billing and tuition collections.\nReconcile financial aid recognition as needed during the year and annually.\nServe as primary liaison for tuition system technology support and Blackbaud.\n\nQUALIFICATIONS\n\nBachelor’s degree in accounting; MBA or CPA preferred\nSeven or more years in progressively responsible experience\nNon-profit accounting experience preferred\nKnowledge of Financial Edge preferred\nDemonstrated proficiency in Microsoft Excel\nDemonstrated knowledge of financial reporting and audit support\nSuperior attention to detail, with excellent analytical skills\nExcellent written and verbal communication skills\n\n\nReady to Join SF Day?\n\nSF Day celebrates and welcomes faculty and staff who reflect the broad range of\n\ndiversity in the Bay Area. We encourage people of color and LGBTQ+ applicants to\n\napply. SF Day offers excellent benefits and a competitive salary.\nPlease apply online: https://sanfranciscodayschool.bamboohr.com/hiring/jobs/60\nSan Francisco Day School\n\n350 Masonic Avenue\n\nSan Francisco, CA 94118\n\nwww.sfday.org",
        "job_posted": "2 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=2edaf66efaad3fc4&fccid=ca21d5fb91b03e1e&vjs=3",
        "page": 3
    },
    {
        "position": "Professional Staff Accountant - CPA firm",
        "job_type": "Full-time",
        "company_name": "Fong Ko & Associates LLP",
        "location": "San Mateo, CA 94404",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Professional Staff Accountant – CPA firmEstablished mid-peninsula CPA firm is seeking staff accountants with tax and accounting experience (CPA preferred) to join its professional staff. Candidate must be self- motivated and a team player, have excellent oral and written communication skills, and be able to handle multiple tasks in a fast paced environment.Our firm is a full service public accounting firm and provides domestic and international tax consulting and preparation services to individuals and business entities. We also offer audit, review, compilation services and other consulting and accounting services to businesses.Duties and responsibilities include:* Preparing supporting documentation by gathering, sorting, and organizing financial data and documents; establishing priorities and communicating with clients.* Preparing federal, state, and local tax returns using Lacerte and other software.* Researching current regulations and ensuring compliance with tax regulations and authorities.* Performing audit, review or compilation of financial statements for business clients.* Providing assistance in tax audits by IRS, FTB and other tax authorities.Skills/Qualifications:Bachelor degree in accounting or taxation required.Accounting and tax experience preferred.Successful completion of CPA exam or in progressExcellent oral and written communication skills.Experience with QuickBooks, Excel, Word and Lacerte.Knowledge of GAAP, IFRS & GAASOrganized, mature, flexible, with strong work ethic.Strong interpersonal skillsPlease send a cover letter and resume via email to Fong Ko & Associates LLPResume submitted without a cover letter will not be considered.Job Type: Full-timeBenefits:Health insurancePaid time offProfessional development assistancePhysical Setting:OfficeSchedule:8 hour shiftMonday to FridayEducation:Bachelor's (Preferred)License/Certification:CPA (Preferred)Work Location: One location",
        "job_posted": "3 days ago",
        "url": "https://www.indeed.com/company/Fong-Ko-&-Associates-LLP/jobs/Professional-Staff-Accountant-db12e46ac357145f?fccid=9e8f5c06a7c26cfe&vjs=3",
        "page": 3
    },
    {
        "position": "Entry Level Tax Associate",
        "job_type": "Full-time",
        "company_name": "Spiegel Accountancy Corp.",
        "location": "Pleasant Hill, CA 94523",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Spiegel Accountancy Corp. is a growing, professional accounting firm based in Pleasant Hill, CA with a national practice specializing in the mortgage banking and private lending sectors. Our client commitment to being a strategic, innovative and responsive partner distinguishes us from other accounting firms. The combination of being strategic advisors to our clients and providing business development and technical growth opportunities to our staff has enabled our firm to emerge as an industry leader on a national level.At Spiegel Accountancy Corp., we know that the members of our team are our most valuable asset. We are dedicated to helping expand their personal and professional development. We offer a buddy program, coaching, and provide timely and productive feedback.Due to our continued growth, we are seeking entrepreneurially minded individuals who have a passion for technical issues to join our tax department. We are looking for someone who can thrive in a fast paced, deadline driven work environment. Ideal applicants will have well-rounded knowledge of accounting and tax principles, progress towards obtaining CPA licensure, and commitment to offering clients the highest level of service.DUTIES AND RESPONSIBILITIES:- Preparation of individual, corporate and partnership income tax returns- Filing multi-state income tax returns- Build strong relationships with clients while providing exceptional client service- Research tax laws, rules and regulations and apply to specific situations- Collaborate in a team environment and proactively seek guidance and feedback- Work independently, prioritize and manage multiple tasksREQUIREMENTS:- A Bachelor's or Master's degree in accounting, taxation, finance or related discipline- CPA license or progression towards obtaining licensure- Strong academic credentials (minimum GPA of 3.0)- Strong leadership, problem-solving, and communication skills- Possess a passion to learn and to work on new and challenging engagements- Ability to interact with various levels of client and firm management through both written and verbal communications- Must demonstrate a thorough understanding of Microsoft Excel- Prior work experience in tax, accounting or a related field is a plus- Proficiency in software such as Axcess Tax and QuickBooks is a plusThis position is full-time with mandatory overtime hours during busy season (January 2nd through April 15th). We offer a competitive salary, comprehensive benefits package, and growth opportunities. Please visit our website at www.spiegel.cpa to learn more.Interested candidates must submit a cover letter detailing their qualifications and interest in this position along with their resume and college transcripts. Please upload them to Indeed.Job Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceDisability insuranceHealth insuranceLife insurancePaid time offVision insuranceSchedule:8 hour shiftMonday to FridaySupplemental Pay:Bonus payCOVID-19 considerations:We follow all county, state and federal requirements to keep our employees safe. We also provide face masks, face shields and sanitizer to all employees.Education:Bachelor's (Preferred)Experience:Tax experience: 1 year (Preferred)License/Certification:CPA (Preferred)Work Location: One location",
        "job_posted": "11 days ago",
        "url": "https://www.indeed.com/company/Spiegel-Accountancy-Corp./jobs/Entry-Level-Tax-Associate-fd34a2cef094cdc5?fccid=ae74c9d8cd116d6d&vjs=3",
        "page": 3
    },
    {
        "position": "Tax Staff - SEASONAL",
        "job_type": "Full-time, Part-time",
        "company_name": "Krutilla & Associates",
        "location": "Walnut Creek, CA 95498",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Krutilla & Associates is a fast-growing CPA firm based in Walnut Creek specializing in tax and consulting services for a variety of large and mid-sized clients. Our clients include real estate opportunity funds, real estate investment trusts, homebuilders, technology companies, professional service firms, and high net worth individuals. Qualified candidates will obtain experience working on many challenging projects in a casual environment. Candidates will work as part of a team to complete tax returns and advise clients on tax planning opportunities. Candidates will also have an opportunity to work directly with our clients to provide planning ideas and to obtain documents necessary for the preparation of tax returns.We are seeking qualified candidates to prepare tax returns on a seasonal, full-time, or part-time basis. Seasonal employees will generally work 30-40 hours per week during tax season.As a Seasonal Tax Staff Associate you will be responsible for the following:Preparation of Individual, Partnership, Corporate, and/or Trust tax returnsAccounting calculations needed to prepare tax returns and quarterly estimatesPerform online tax researchDevelopment of general technical and tax planning skillsQualifications:Familiarity with Microsoft Office products (including Word and Excel)General knowledge of accounting principlesWorking towards completion of CPA exam preferredJob Types: Full-time, Part-timeBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insurancePaid time offVision insuranceWork from homeSchedule:Monday to FridayExperience:Accounting: 2 years (Preferred)Tax Experience: 2 years (Required)Work Location: One location",
        "job_posted": "5 days ago",
        "url": "https://www.indeed.com/company/Krutilla-&-Associates/jobs/Tax-Staff-7259fe154f216d40?fccid=3f81abd840d4fde9&vjs=3",
        "page": 3
    },
    {
        "position": "MOBILE TAX PREPARER",
        "job_type": "Full-time, Contract",
        "company_name": "Exquisite Tax Service",
        "location": "San Francisco, CA 94122",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "VIRTUAL TAX PREPARER About usWe are challenging, bold, innovative and our goal is to CREATE TEAM OF ENTREPRENUERS TRAINED TO BE SUCCESSFUL TAX PROFESSIONALS. WE HAVE A SOLUTION TO ALL TAX PROFESSIONAL NEEDS NO MATTER IFF YOU ARE A NEWBIE OR VET.Our work environment includes:Safe work environmentWellness programsRelaxed atmosphereWork-from-home daysWANT TO START YOUR OWN TAX PREPARATION SERVICE? WANT TO OFFER YOUR CLIENTS CASH ADVANCES UP TO $6000 DOLLARS? WE ARE HERE TO HELP! WE ARE LOOKING FOR SELF DRIVEN ENTREPRENUERS READY TO MAKE RESIDUAL INCOME. NO STARTUP MONEY NO PROBLEM.Job Types: Full-time, ContractPay: $9.00 - $31.00 per hourBenefits:Flexible scheduleSupplemental Pay:Commission payCOVID-19 considerations:WE OFFER MOBILE APP SO YOU CAN RUN YOUR VIRTUALLY OR IN A OFFICE SETTING. THE SOFTWARE IS COMPLETELY PAPERLESS AND CLIENTS CAN UPLOAD ANY DOCUMENTS THROUGH THE APP.Education:Bachelor's (Preferred)License/Certification:CPA (Preferred)Work Location:One locationWork Remotely:YesWork Location: One location",
        "job_posted": "13 days ago",
        "url": "https://www.indeed.com/company/Exquisite-Tax-Service/jobs/Mobile-Tax-Preparer-3549f6ccf5cc6d30?fccid=0aba77264318d8f8&vjs=3",
        "page": 3
    },
    {
        "position": "Tax Senior Associate",
        "job_type": "Full-time",
        "company_name": "Krutilla & Associates",
        "location": "Walnut Creek, CA 95498",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Krutilla & Associates is a fast-growing CPA firm based in Walnut Creek specializing in tax and consulting services for a variety of large and mid-sized clients. Our clients include real estate opportunity funds, real estate investment trusts, homebuilders, technology companies, professional service firms, and high net worth individuals. Qualified candidates will obtain experience working on many challenging projects in a casual environment. Candidates will work as part of a team to complete tax returns and advise clients on tax planning opportunities. Candidates will also have an opportunity to work directly with our clients to provide planning ideas and to obtain documents necessary for the preparation of tax returns.We are seeking qualified candidates to prepare tax returns on a seasonal, full-time, or part-time basis. Our full-time employees will be expected to work some overtime but less than a typical CPA firm. Part-time employees generally do not work overtime, and seasonal employees' schedules fluctuate throughout the year.As a Tax Senior Associate you will be responsible for the following:Preparation and/or review of Individual, Partnership, Corporate, and/or Trust tax returnsAccounting calculations needed to prepare tax returns and quarterly estimatesPerform online tax researchDevelopment of general technical and tax planning skillsQualifications:Minimum GPA: 3.2Familiarity with Microsoft Office products (including Word and Excel)General knowledge of accounting principlesCPA or working towards completion of CPA exam preferredJob Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insurancePaid time offVision insuranceWork from homeSchedule:Monday to FridayExperience:Accounting: 2 years (Required)Tax Experience: 2 years (Required)Work Location: One location",
        "job_posted": "5 days ago",
        "url": "https://www.indeed.com/company/Krutilla-&-Associates/jobs/Tax-Senior-Associate-2481a7945d204c06?fccid=3f81abd840d4fde9&vjs=3",
        "page": 3
    },
    {
        "position": "Tax Manager",
        "job_type": "Full-time",
        "company_name": "Mowat Mackie & Anderson LLP",
        "location": "Oakland, CA 94612",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": 120000,
        "salary_high": 150000,
        "experience": null,
        "description": "Mowat Mackie & Anderson LLP (\"MMA\") is looking to add an experienced Tax Manager with extensive entity experience to lead and manage multiple operations of the tax practice area and to deliver high-quality tax services. In client assignments, the Tax Manager is involved in almost all of the areas for which partners are responsible. This role exhibits technical proficiency and the ability to supervise and complete engagements while serving as intermediaries between partners, clients, and senior accountants. The Tax Manager has a proven record of building profitable and sustainable client relationships.\nMeet Mowat Mackie & Anderson LLP\nMMA is a dynamic and responsive, high-value CPA firm that serves closely-held businesses, high net worth individuals, trusts and estates, and other clients throughout California and globally.\nWe hire engaged employees and support our team with hybrid work, a robust benefits package as well as provide numerous perks including team activities, training, education stipends, and\nsupport for community involvement. Additional benefits include targeted industry compensation, 401(k) and profit-sharing, medical/dental/vision, life insurance, short-term and long-term\ndisability insurance.\nThis is an ideal position for a smart, motivated individual who is passionate about delivering strategic value in a fast-paced, collaborative environment. A strong ability to take charge and meet tight deadlines will ensure your success in this multi-faceted role.\nYour responsibilities will include:\n\nDevelop a full range of tax services in compliance with laws and regulations with a time frame.\nBuild relationships and interact with clients to provide excellent planning, consulting and expertise.\nProvide innovative tax planning and review complex income tax returns;\nReview engagement work papers, resolve any problems, spot issues and keep the partner informed of all important developments.\nIdentify and mitigate tax risks.\nPrepare client billings and monitor realization on engagements.\nManage the tax provision and tax compliance process.\nImprove processes by developing or implementing best practices.\nEnsure effective utilization of staff through proper assignment and delegation of duties and assess their performance.\nManage and coordinate tax audits.\nPrepare all tax papers on a regular basis and handle all information data requests.\nEnsure that all projects are thoroughly reviewed before they reach the partner, and that all applicable checklists and procedures have been followed.\nEstablish a habit of accuracy and promptness in preparing administrative reports and of compliance with the Firm's administrative procedures, i.e., timesheets, expense reports, department meetings.\nUpdates job knowledge by participating in educational opportunities; reading professional publications and new regulations.\nApproaches responsibilities and the disposition of problems in a long-term profit-oriented manner to help ensure the continued growth of the firm.\n\n\nDesired Skills and Experience:\n\nLicensed CPA.\nBA in Accounting or MA in Taxation.\nProven work experience as a tax manager.\nExcellent knowledge of tax accounting, tax compliance and all types of tax returns.\nStrong leadership and personnel management skills.\nStrong analytical skills to assess problems or unusual situations and quickly determine efficient solutions.\nDemonstrates a working knowledge of CCH Products (ProSystem fx Tax, Engagement, Client Portal, etc).\n\n\nAdditional Knowledge and Skills:\n\nAble to prioritize, multitask, work under pressure and handle interruptions while maintaining flexibility in work assignments.\nAbility to independently perform all the duties of the position efficiently and effectively.\nGood at meeting deadlines and solving problems.\nComfortable providing feedback.\nAbility to be flexible in response to changing priorities and needs.\nYou are highly collaborative and team-oriented.\nAbility to work under pressure in a deadline-oriented business.\nYou work well with little direction but know when to ask for help and keep your team informed.\n\n\nMeet Mowat Mackie & Anderson LLP\nResponsive, creative, high-value CPA services for closely-held businesses, high net worth individuals, trusts and estates.\nDo you fit this description?\n\nExperienced and highly motivated\nIntellectually curious\nLooking for a challenging and stimulating environment\nPrefers a workplace that provides autonomy and rewards independent and critical thinking\nGoes beyond ordinary compliance to provide outstanding service to clients\n\n\nIf so, you’d fit right in at MMA – and we’d like to speak with you!\nWe take great pride in delivering the highest-quality service and are listed as one of the Top Ten East Bay Area accounting firms.",
        "job_posted": "12 days ago",
        "url": "https://www.indeed.com/rc/clk?jk=c346e52a72b0d49f&fccid=1a68c981216c206a&vjs=3",
        "page": 3
    },
    {
        "position": "Cost Accounting Specialist-CLMB",
        "job_type": "Full-time",
        "company_name": "Columbus Craft Meats",
        "location": "Hayward, CA 94557",
        "company_rating": null,
        "company_reviews": null,
        "reviews_link": null,
        "salary_low": null,
        "salary_high": null,
        "experience": null,
        "description": "Job DescriptionEssential Duties and ResponsibilitiesValidating Daily manufacturing production tonnage and yields in AS400 system (25%)Monitoring and Reconciling Finished Goods and WIP Inventories and reconcile difference between AS400 and QAD Inventory SystemReconciliations of Outside warehouse inventories and verifying our internal inventory level is accurate.Weekly Inventory Cycle counts, providing count sheets, enter counts system and providing results to plantCoordinates and supervises period and fiscal year-end inventories.Assist in Month-end Close process and Provide timely and accurate financial reports and schedulesAssists in the other duties as directed by their supervisor as the incumbent builds on their experiences.Job Type: Full-timeSchedule:8 hour shift",
        "job_posted": "14 days ago",
        "url": "https://www.indeed.com/company/Columbus-Craft-Meats/jobs/Cost-Accounting-Specialist-Clmb-c8473bbb1ff10146?fccid=2378fc26d87bc9ee&vjs=3",
        "page": 3
    }
]